[
    {
        "company": "Navista",
        "logo": "navista",
        "customer": "Navista",
        "cat": "R & D",
        "dtstart": "2004-03-01",
        "dtend": "2006-11-30",
        "tags": ["Linux embedded", "PXE", "Perl", "Shell", "Rdesktop", "X11", "CGI"],
        "role": "Responsable produit & Lead Dev",
        "title": "Conception appliance Diskless",
        "desc": "La société Navista m’a confié la R&D de leur nouvelle appliance (Diskless) devant permettre la suppression des postes informatiques classiques. Le cahier des charges était de proposer un client léger sans aucun stockage (disque dur, mémoire flash, carte mémoire …) capable de se connecter selon plusieurs protocoles (TSE, X11, …) à des serveurs centraux.",
        "team": "1 Lead Dev",
        "tasks": ["Conception et réalisation d’un prototype", "Mise en place d’un show room et d'un kit de démonstration", "Industrialisation", "Mise à jour du prototype et recette", "Mise en place de l’architecture réseau nécessaire et installation des serveurs Windows et Linux", "Création d’une offre de commercialisation et mise en œuvre (audit, installation...)."]
    },
    {
        "company": "Navista",
        "logo": "navista",
        "customer": "Navista",
        "cat": "R & D",
        "dtstart": "2005-01-31",
        "dtend": "2006-11-30",
        "tags": ["Java", "JEE", "EJB3", "Applet", "Web Services", "Axis", "Linux", "CentOS", "SQLite"],
        "role": "Responsable produit & Lead Dev",
        "title": "Développement outil de maintenance predictive",
        "desc": "La société Navista installe chez ses clients des appliances rackables info gérées permettant de leur offrir des services et prestations autour du réseau (VPN, Proxy, antivirus, firewall …). Ces appliances ont une capacité de collecte d’informations à des fins de maintenance (débit réseau, température, …). Le projet LoRA (Log Report Analyzer) avait pour but de permettre la collecte de ces informations et la génération de rapports pour offrir aux clients une photo « diagnostique » de leur réseau. L’objectif secondaire était d’offrir une capacité de maintenance préventive",
        "team": "1 CP / Lead Dev, 1 Dev JEE",
        "tasks": ["Conception du protocole de dialogue et de l’architecture générale", "Conception et réalisation du serveur et des clients", "Création d’une application de visualisation et de reporting des informations collectées."]
    },
    {
        "company": "Navista",
        "logo": "navista",
        "customer": "Navista",
        "cat": "R & D",
        "dtstart": "2003-10-06",
        "dtend": "2006-11-30",
        "tags": ["C++", "Linux", "Shell", "FTP", "API", "Modem GSM"],
        "role": "Responsable produit & Lead Dev",
        "title": "Chaine autonome de diffusion SMS",
        "desc": "La société Navista dispose de plusieurs sites permettant l’envoie de SMS depuis le web et/ou le minitel. La diffusion se faisait uniquement via un brocker à l’étranger, avec une fiabilité non optimum. Dans le cadre de la refonte de cette chaine de SMS, il a été décidé de mettre en place une solution fiable et sécurisée proposant un chiffrement de bout en bout, de la collecte au niveau du web/minitel jusqu’à la diffusion. La chaine doit determiner le meilleur moyen de diffusion (brocker, modem) en fonction des choix et des crédits dépensés par le client, et être résiliente aux pannes.",
        "team": "1 Lead Dev",
        "tasks": ["Conception et réalisation d’un prototype", "Développement des différents modules en C++", "Tests de diffusion directe par modem & carte embarquée", "Tests de charge et de résilience", "Déploiement en production et support"]
    },
    {
        "company": "Navista",
        "logo": "sales-producteurs",
        "customer": "Sales Producteurs",
        "cat": "Conseil & Expertise",
        "dtstart": "2003-10-06",
        "dtend": "2006-11-30",
        "tags": ["Windows", "Windows TSE", "Linux", "SCO Unix", "EAN 13", "EAN 128", "PHP", "C++", "Java", "HTML", "Assembleur"],
        "role": "Chargé de mission DSI",
        "title": "Gestion de l'informatique d'entreprise",
        "desc": "Après plusieurs années d’accompagnement via la junior entreprise de l’IMERIR, la SARL Sales producteur m’a confié la charge de l’ensemble des sujets informatiques de l’entreprise. Cette mission englobe la participation aux choix d’investissements matériels et logiciels, à l’accompagnement au MCO des outils informatiques, ainsi qu’à la mise en place de la traçabilité et de l’étiquetage des chaînes de production.",
        "team": "1 Consultant",
        "tasks": ["Changement de la suite vente/compta (migration Unix -> Windows)", "Déploiement de la solution Navista Diskless sur le site", "Conception et déploiement d’une salle machine", "Définition du process de traçabilité et développement des outils", "Définition du besoin", "sélection et installation d’étiqueteuses automatiques"]
    },
    {
        "company": "Navista",
        "logo": "sotranasa",
        "customer": "Sotranasa",
        "cat": "Developpement",
        "dtstart": "2005-04-25",
        "dtend": "2006-11-30",
        "tags": ["Eclipse", "JBoss AS", "CentOS Linux", "Java", "JEE", "EJB3", "WS"],
        "role": "Responsable produit & Lead Dev",
        "title": "Développement d'un ERP",
        "desc": "Le groupement d’entreprises Sotranasa est l’un des principaux sous-traitants Orange et ERDF de la région Languedoc-Roussillon. L’évolution des technologies et en particulier des web services l’ont poussé à revoir son ERP à base de PHP pour une solution plus pérenne et plus « connectée ». Elle m’a confié la conception et la réalisation de leur nouvel ERP SCOT v2, devant bénéficier de nouvelles fonctionnalités pour les équipes et d’une communication plus efficace (au fil de l’eau) avec les organismes commanditaires.",
        "team": "1 CP / Lead Dev, 1 Dev JEE",
        "tasks": ["Conception d’un ERP modulaire", "Audit de l’existant (SCOT v1)", "Conception d’un système mutualisé(marque blanche)", "Conception d’un système de PUSH pour les terminaux de type Smartphones / PDA", "Communication des OT (travaux) au fil de l’eau via web services sécurisés avec pièce jointe", "Gestion des équipes, véhicules, plannings..."]
    },
    {
        "company": "SQLI",
        "logo": "msa",
        "customer": "GIE Agora (MSA)",
        "cat": "Developpement",
        "dtstart": "2006-12-04",
        "dtend": "2007-12-21",
        "tags": ["IBM AIX", "BEA Weblogic AS", "Oracle", "JProfiler", "Eclipse", "Java", "JEE", "Struts", "Ksh", "Bash", "XML", "Y20", "Hibernate "],
        "role": "Tech Lead",
        "title": "Tech Lead au sein du socle JEE",
        "desc": "Le GIE Agora est en charge des développements informatiques de la MSA. Afin d’homogénéiser ses applications, le GIE a mis en place un Socle Technique JEE Transverse aussi appelé socle G1. Ce socle sert de base au développement de l’ensemble des applications (régionales, nationales, …). Dans le cadre d’une régie de longue durée, j’ai pu participer à des phases d’études, de conception, de développement et d’expertise autour du socle technique G1. J’ai aussi eu la charge, en relation avec Bull et BEA, du support niveau 3 pour les problèmes complexes rencontrés par les équipes de développement.",
        "team": "1 RA, 1 CP, 18 développeurs expérimentés",
        "tasks": ["Ajout de fonctionnalités (Étude", "conception", "réalisation maintenance)", "Création des scripts d’installation/pilotage du produit", "Pilotage des versions mineures", "Gestion des évolutions et du support", "Expert du socle technique auprès des autres équipes", "Optimisation des performances", "-Analyse JProfiler", "-Identification des points de contention et préconisation de correction", "-Passage de 51M d’objets / 1,7Go Ram à 11M/500Mo RAM à périmètre iso-fonctionnel."]
    },
    {
        "company": "SQLI",
        "logo": "msa",
        "customer": "GIE Agora (MSA)",
        "cat": "Prototypage",
        "dtstart": "2008-01-07",
        "dtend": "2008-11-28",
        "tags": ["JIRA", "Confluence", "Hudson", "Continuum", "MySQL", "Apache", "Artifactory", "RHEL", "Java", "JEE", "ant", "Maven  "],
        "role": "Architecte / Expert JEE",
        "title": "Refonte de l'usine CI/CD JEE",
        "desc": "Le GIE Agora a lancé un programme d’industrialisation de ces développements afin de rationaliser les coûts et les délais de ceux-ci. C’est dans ce contexte que le prototypage d’une plateforme d’intégration continue m’a été confié, avec pour objectif de simplifier la mise en œuvre des postes développeurs et la construction du produit.",
        "team": "1 CP, 1 expert JEE",
        "tasks": ["Création des process nécessaires à la mise en place d’une intégration continue", "Mise en place des outils nécessaires : Maven2", "Subversion", "repository Archiva", "Continuum", "Mise en œuvre de JIRA et Confluence pour la création d'une base de connaissance", "Définition d’un poste de développement basé sur Eclipse", "Définition des plugins et de leur configuration."]
    },
    {
        "company": "SQLI",
        "logo": "msa",
        "customer": "GIE Agora (MSA)",
        "cat": "Expertise",
        "dtstart": "2008-01-07",
        "dtend": "2008-11-28",
        "tags": ["BEA Weblogic AS", "JBoss AS", "MySQL,Messaging", "MQ", "JMS", "protocole PANAM (Sésame)", "XML", "java", "JEE  "],
        "role": "Architecte / Expert JEE",
        "title": "Conception, développement & déploiement chaîne Sesame Vitale 2",
        "desc": "Dans le cadre de la carte Sésame Vitale 2, le GIE Sésame Vitale a envoyé à ses différents partenaires un cahier des charges décrivant le processus de communication asynchrone (basés sur JMS) pour la mise à jour des informations des cartes lors de leur insertion dans les bornes spécifiques. Le GIE SV a également distribué un connecteur en charge du traitement des messages, devant être intégré dans un serveur Weblogic. Le GIE Agora m’a confié la mission de proposer une architecture alternative à base de JBoss AS devant être capable de fournir une fiabilité et des performances à minima équivalentes à la version Weblogic. La mission comprenait également la création des chaînes de liaison entre le centre national et la caisse régionale en charge de l’adhérent.",
        "team": "1 CP, 1 expert JEE",
        "tasks": ["Modélisation de la chaîne de liaison", "-Conception des mises à jour nécessaires dans le socle technique de la MSA", "-Conception d’un serveur frontal de traitement des données (Frontal CAC)", "-Connexion du serveur frontal à la chaîne de liaison", "-Connexion du serveur frontal au SI de la MSA via le socle technique JEE", "Rédaction des documents d’architecture de la chaîne de liaison (côté MSA)", "Rédaction des préconisations et des manuels d’installation", "Assistance au déploiement et à la mise en place", "Gestion de la performance", "-Analyse du connecteur fourni par le GIE Sésame Vitale", "-Création des testes de performance (charge, stress, endurance, rupture)", "-Réalisation d’un comparatif Weblogic (recommandation SV) vs JBoss AS", "-Optimisation de l’environnement et mise en place de la haute disponibilité", "+Passage d’un overhead GC de 8% à 0,49%", "+Passage d’un temps de traitement de 142ms à 106ms"]
    },
    {
        "company": "SQLI",
        "logo": "toulouse-metropole",
        "customer": "Toulouse Metropole",
        "cat": "Conseil & Expertise",
        "dtstart": "2008-11-03",
        "dtend": "2009-04-06",
        "tags": ["Linux", "Red Hat", "RHEL", "JBoss EAP", "Tomcat", "JBoss Operation Network (JON)", "Shell", "RPM", "Apache", "mod_jk", "mod_proxy", "mod_balancer "],
        "role": "Consultant JEE",
        "title": "Hebergement mutualisé JEE",
        "desc": "Dans le cadre de la rationalisation de ses hébergements JEE, la Communauté Urbaine Toulouse Métropole m’a confié la mission de proposer une solution d’hébergement JEE mutualisé respectant un certain nombre de contraintes (support, haute disponibilité, …) et de l’assister dans la mise en œuvre de cet environnement.",
        "team": "1 Consultant",
        "tasks": ["Assistance à la définition et la qualification de l’environnement JEE HA mutualisé", "-Recueil des besoins et de l’existant", "-Création d’une liste d’exigences", "composée de critères adaptés", "mesurables et pondérés", "-Identification des risques liés à l’environnement cible", "-Evaluation et notation des serveurs. Accompagnement lors du processus de choix", "-Préconisation de l’architecture haute disponibilité et du plan de mise en œuvre", "Mise en œuvre de la solution préconisée", "-Création d’un prototype", "-Tests de pannes et de reprise après incident", "-Rédaction d’un guide de déploiement et d’un dossier d’architecture technique", "-Transfert de compétence auprès des équipes systèmes", "-Préconisation et recommandations à insérer dans les futurs appels d’offre", "-Accompagnement et assistance sur les premiers projets"]
    },
    {
        "company": "SQLI",
        "logo": "spot-img",
        "customer": "Spot Image",
        "cat": "Conseil & Expertise",
        "dtstart": "2008-12-08",
        "dtend": "2009-05-18",
        "tags": ["Java", "JEE", "Tomcat", "XML", "Web Services", "JSP", "Paiement en ligne"],
        "role": "Consultant JEE",
        "title": "Solution de Paiement par CB Spot Checkout",
        "desc": "La société Spot Image est en charge, entre autres, de la commercialisation des images des satellites SPOT. Afin de permettre d’étendre cette commercialisation à des clients internationaux, elle m’a confié la conception et la réalisation d’une solution de paiement par carte bleue pouvant être utilisée avec toutes les plateformes de vente de l’entreprise (Spot Checkout).",
        "team": "1 Consultant",
        "tasks": ["Dialogue propriétaire à base de XML chiffré entre les sites et la centrale", "Interface de gestion des paiements", "Génération automatique de factures et diffusion vers les magasins de vente", "Préconisation et préparation de l’environnement de haute disponibilité.."]
    },
    {
        "company": "SQLI",
        "logo": "Haras-nationaux",
        "customer": "IFCE (Haras Nationaux)",
        "cat": "Conseil & Expertise",
        "dtstart": "2009-02-02",
        "dtend": "2009-12-14",
        "tags": ["Linux", "Oracle", "Red Hat", "RHEL", "JBoss SOA P (Fuse)", "JBoss EAP", " PHP", "Zend", "Apache", "Services", "Web service", "Cluster", "JMX", "Java"],
        "role": "Consultant / Architecte JEE",
        "title": "Refonte SOA du SI",
        "desc": "Dans le cadre de la modernisation de son SI, les Haras Nationaux m’ont demandé d’intervenir pour les assister dans la refonte complète du SI autour de la définition et du prototypage d'une organisation SOA. La nouvelle organisation devait, entre autres, proposer une plateforme d’échange entre le monde Java et le monde PHP.",
        "team": "2 Consultants / Architectes JEE",
        "tasks": ["Interview des différents acteurs du SI (DSI", "Etudes", "Exploitation", "Prestataires ...)", "Présentation des principes d’une architecture SOA et de ses avantages pour l’IFCE", "Comparaison des offres Java / Microsoft et PHP pour la création de services métiers", "Création d’une matrice de comparaison des serveurs JEE avec critères pondérés", "Préconisations sur les orientations à prendre sur la période 2009 / 2013", "Prototypage de la plateforme JEE Haute Disponibilité."]
    },
    {
        "company": "SQLI",
        "logo": "toulouse-metropole",
        "customer": "Toulouse Metropole",
        "cat": "Conseil & Expertise",
        "dtstart": "2009-05-04",
        "dtend": "2009-07-17",
        "tags": [".Net", "JMeter", "Kerberos "],
        "role": "Consultant Perf. IT",
        "title": "Audit performance Allo Mairie",
        "desc": "Le service « Allo Mairie » a été mis en place afin de permettre aux riverains de signaler tout type de nuisances (bruit, encombrants, état des infrastructures, …). Pour permettre ce service, les hot liners ont été dotés d’un progiciel. La collectivité m’a missionné pour réaliser une analyse des performances de leur progiciel afin de m’assurer de sa capacité à pouvoir supporter les périodes de forte charge.",
        "team": "2 Consultants",
        "tasks": ["Analyse du fonctionnement du progiciel (à base de développement .Net)", "Création de scénarios JMeter spécifiques aux besoins de la collectivité", "Estimation des charges nécessaires à partir des informations de volumétries existantes", "Exécution des tests et collecte des métriques serveurs", "Analyse des résultats et remise d’un rapport."]
    },
    {
        "company": "SQLI",
        "logo": "akerys",
        "customer": "Akerys / Belvia",
        "cat": "Expertise",
        "dtstart": "2009-03-02",
        "dtend": "2009-12-18",
        "tags": ["Tomcat", "Linux", "Debian", "Apache", "mod_jk", "Jasig CAS", "SSO", "Spring", "Hibernate", "XML", "Web Service", "Exalead", "MySQL", "Talend", "Java", "JEE", "JMeter "],
        "role": "Architecte / Expert JEE",
        "title": "Refonte du socle IAM/SSO",
        "desc": "La société Akerys disposait d’un socle technique commun à l’ensemble de ces portails JEE. Elle m’a confié la refonte du socle et de l’authentification SSO afin de permettre aux applications une meilleure stabilité et de meilleures performances.",
        "team": "2 consultants",
        "tasks": ["Audit de l’existant (Tomcat avec un socle basé sur Jasig CAS", "Spring et hibernate). ", "Réorganisation complète de l’infrastructure et des flux", "Mise en place d’un prototype basé sur 2 VM avec :", "-Plusieurs instances de Tomcat en fail-over", "-Plusieurs instances de Tomcat en load-balancing", "Serveur http frontal avec routage adapté", "Migration du JDK 5 / Tomcat 5.5 vers le JDK 6 et Tomcat 6", "Assistance au déploiement dans les différents environnements (Int", "Recette et Prod)", "Mise en place d’une campagne de test de performance (charge", "stress", "endurance)", "-Définition des scénarios d’injection", "-Identification et mise en œuvre de la collecte des métriques", "-Analyse et restitution des résultats"]
    },
    {
        "company": "SQLI",
        "logo": "msa",
        "customer": "GIE Agora (MSA)",
        "cat": "Expertise",
        "dtstart": "2009-09-07",
        "dtend": "2009-12-18",
        "tags": ["SAML", "SSL", "Mon Service Public (MSP)", "Liberty Aliance", "Tomcat", "Interligo", "Apache", "openSSL", "Certificats  "],
        "role": "Architecte / Expert JEE",
        "title": "Fédération d'identité avec Mon Service Public (MSP)",
        "desc": "Dans le cadre de son intégration avec le service gouvernemental « Mon Service Public », le GIE Agora m’a confié l’intégration de la fédération d’identité permettant de créer la liaison entre les services MSA et MSP.",
        "team": "1 CP, 1 expert JEE",
        "tasks": ["Mise en place d’une zone de confiance (authentification par certificats mutuels)", "Utilisation de SSL et chiffrage des échanges", "Mise en place de la fédération basée sur Liberty Alliance", "Mise en place d’un serveur frontal haute disponibilité pour gérer la fédération et communiquer avec l’extranet de la MSA."]
    },
    {
        "company": "SQLI",
        "logo": "toulouse-metropole",
        "customer": "Toulouse Metropole",
        "cat": "Conseil & Expertise",
        "dtstart": "2009-08-31",
        "dtend": "2009-12-18",
        "tags": ["Alfresco Labs", "Alfresco EE", "JBoss EAP", "JVisual VM", "Linux", "Red Hat", "RHEL", "Java", "JEE", "JMX", "MySQL", "CIFS", "Jasig CAS", "WebDAV", "VMWare", "LDAP", "Active Directory"],
        "role": "Consultant / Architecte JEE",
        "title": "Prototypage d'une solution de GED Alfresco",
        "desc": "La collectivité a fait le choix de se doter d’une GED Alfresco EE afin de pouvoir gérer sa documentation projet ainsi que toute la conservation des documents de leur portail Liferay. C’est dans ce contexte qu’elle m’a confié un rôle d’assistance et prototypage d'une solution GED Alfresco dans l'environnement SI de la collectivité (SSO, LDAP, AD, Plateforme JEE HA, ...).",
        "team": "1 Consultant",
        "tasks": ["Mise en place d’un prototype (JEAP / RHEL4 / MySQL / VM Ware)", "Intégration du prototype avec le SI (Connexion active directory", "SSO web et CIFS avec NTLM)", "Identification des risques liés à l’environnement cible", "Rédaction du Dossier d’Architecture Technique."]
    },
    {
        "company": "SQLI",
        "logo": "toulouse-metropole",
        "customer": "Toulouse Metropole",
        "cat": "Expertise",
        "dtstart": "2009-04-20",
        "dtend": "2009-11-20",
        "tags": ["Java", "JEE", "JBoss", "Linux", "Red Hat", "RHEL", "Jasig CAS", "Kerberos", "LDAP", "Active Directory", "Reverse proxy", "Apache", "VMWare"],
        "role": "Architecte / Expert JEE",
        "title": "Mise en place du SSO interne/externe",
        "desc": "La communauté Urbaine Toulouse Métropole m’à confié la conception et la mise en œuvre du SSO au sein de leur réseau. Les choix de la solution Jasig CAS et d’une mise en œuvre avec Fail-over et Kerberos/NTLM a été fait. J’ai dû recréer différents modules pour permettre la prise en compte de besoins spécifiques, notamment autour du Radius et de l’authentification à travers de multiples dépôts d’identités.",
        "team": "1 Consultant",
        "tasks": ["Création d’un prototype", "Test des différents scénarios", "Création d’un DAT et d’un manuel d’installation et de configuration", "Développement de modules spécifiques", "Déploiement dans l’environnement de recette."]
    },
    {
        "company": "SQLI",
        "logo": "ragt",
        "customer": "RAGT",
        "cat": "Conseil & Expertise",
        "dtstart": "2009-11-23",
        "dtend": "2010-04-02",
        "tags": ["JBoss AS", "Windows 2003", "Apache", "Eclipse"],
        "role": "Architecte / Expert JEE",
        "title": "Audit et amélioration du socle JEE",
        "desc": "Suite à une migration d'IBM Websphere AS vers JBoss AS effectuée par ses équipes internes et plusieurs problèmes rencontrés en production, RAGT m’a confié la réalisation d’un audit et l’accompagnement dans les chantiers d’amélioration de son intranet applicatif.",
        "team": "1 Consultant",
        "tasks": ["Réalisation d’un audit (interview", "analyse des logs et de l’installation", "...)", "Identification des chantiers d’amélioration", "Identification des chantiers prioritaires et proposition de plans d’intervention", "Accompagnement dans le suivi des chantiers", "Formations JBoss spécifiques pour les développeurs et les administrateurs"]
    },
    {
        "company": "SQLI",
        "logo": "msa",
        "customer": "GIE Agora (MSA)",
        "cat": "Conseil & Expertise",
        "dtstart": "2009-11-23",
        "dtend": "2010-12-10",
        "tags": ["JBoss Operation Network (JON)", "Linux", "Redh Hat", "RHEL", "RHQ", "Jopr", "Apache", "JBoss EAP", "JBoss SOA", "Nagios", "SNMP."],
        "role": "Architecte / Expert JEE",
        "title": "Expertise ponctuelle JEE",
        "desc": "Dans le cadre d’un vaste projet de migration de ses environnements AIX/Weblogic vers une solution RHEL/JBoss EAP, le GIE Agora à fait appel à mes services sous forme d’expertises ponctuelles et d’accompagnement autour de problématiques spécifiques à l’intégration des produits Red Hat /JBoss dans son SI.",
        "team": "1 Consultant",
        "tasks": ["Préconisations et assistance à la définition du besoin", "-Assistance lors de la configuration", "l’industrialisation et l’optimisation des serveurs JBoss", "-Assistance et support pour les problèmes rencontrés", "-Assistance à l’intégration du serveur JBoss dans les règles et normes existantes", "Installation de JBoss Operation Network et transfert de compétence", "-Assistance dans l’analyse du besoin des métriques à surveiller", "-Assistance dans l’industrialisation de JBoss Operation Network (JON)s."]
    },
    {
        "company": "SQLI",
        "logo": "akerys",
        "customer": "Akerys / Belvia",
        "cat": "Conseil & Expertise",
        "dtstart": "2010-02-08",
        "dtend": "2010-03-05",
        "tags": ["Java", "Tomcat", "Apache", "JMeter", "Linux", "Debian", "JVisualVM", "JStatD", "MySQL", "Metrokit"],
        "role": "Consultant Perf. IT",
        "title": "Tests de charge/performance Labo-immo",
        "desc": "Akerys a travaillé à la mise en place d’un nouveau service (labo-immo) autour du métier d’achat-vente de logement. Ce service devant être accessible via internet, la société m’a missionné pour réaliser les tests de charge et de performance afin de m’assurer de sa capacité à tenir devant une forte charge.",
        "team": "1 Consultant",
        "tasks": ["Définition des scénarios et des réponses attendues", "Écriture des scénarios", "Industrialisation de la plateforme basée sur JMeter (métrokit)", "Exécution des tests", "Préconisation d'améliorations applicatives / d'architecture. "]
    },
    {
        "company": "SQLI",
        "logo": "msa",
        "customer": "GIE Agora (MSA)",
        "cat": "Conseil & Expertise",
        "dtstart": "2010-04-05",
        "dtend": "2010-05-14",
        "tags": ["JBoss Operation Network (JON)", "Linux", "Red Hat", "RHEL", "RHQ", "Jopr", "Apache", "JBoss EAP", "JBoss SOA", "Nagios", "SNMP"],
        "role": "Architecte / Expert JEE",
        "title": "Prototypage déploiement de JBoss Operation Network",
        "desc": "Le GIE Agora m’a confié le prototypage de l’intégration de la solution JBoss Operation Network (JON) afin de vérifier la capacité de l’outil à répondre à leurs besoins de supervision et de monitoring.",
        "team": "1 Consultant",
        "tasks": ["Présentation du produit (prés requis", "limites", "fonctionnalités", "plugins ...)", "Installation du serveur JON et rédaction de la documentation", "Installation des agents JON et préparation d’une version préconfigurée", "Installation des plugins apache (RT & SNMP) et Tomcat", "Mise à jour du Plugin JBoss pour un fonctionnement avec les queues spécifiques de la MSA", "Configuration via la console et mise en place des alertes", "Analyse du besoin en terme de développement de modules spécifiques."]
    },
    {
        "company": "SQLI",
        "logo": "sanofi-pasteur",
        "customer": "Sanofi Pasteur",
        "cat": "Conseil & Expertise",
        "dtstart": "2010-02-08",
        "dtend": "2010-06-11",
        "tags": ["JBoss EAP", "JBoss Operation Network (JON)", "Windows 2003", "Windows 2008", "MS SQL Server", "Scripts", "Ant", "JMX", "Citrix", "Apache", "Tomcat", "Java", "JEE", "CLI."],
        "role": "Architecte / Expert JEE",
        "title": "Refonte de l'architecture des socles JBoss EAP",
        "desc": "La société Sanofi Pasteur avait entamé une migration de ces applications Tomcat vers un système de serveurs virtualisés hébergeant le serveur JBoss EAP. Suite à plusieurs problèmes techniques, elle m’a missionné pour l’assister dans la mise en place de l’architecture JBoss et la création des procédures d’administration. La nouvelle plateforme devait proposer de la haute disponibilité, un cloisonnement des applications, la mise à jour des applications sans interruption de service ainsi qu’une forte capacité.",
        "team": "1 Consultant",
        "tasks": ["Cohabitation de multiples instances JBoss ", "-hébergeant jusqu'à 100 applications ", "-Permettant une administration centralisée via une interface spécifique", "Audit de l’existant et prise en compte des besoins spécifiques de l’entreprise", "Préconisation d’une architecture HA adapté aux besoins", "Mise en œuvre de la solution préconisée", "Conception et déploiement d’outils complémentaires intégrables à JON", "Développement d’une interface simplifiée", "", "-Adaptée aux besoins des équipes d’administration", "", "-Basée sur l’API remote de JON", "Optimisation des serveurs JBoss."]
    },
    {
        "company": "SQLI",
        "logo": "msa",
        "customer": "GIE Agora (MSA)",
        "cat": "Conseil & Expertise",
        "dtstart": "2010-09-06",
        "dtend": "2010-11-26",
        "tags": ["JBoss EAP", "Linux", "Red Hat", "Visual VM", "JConsole", "JVM", "Java", "JProfiler", "JMeter", "Apache", "JBoss Operation Network (JON)."],
        "role": "Consultant Perf. IT",
        "title": "Tests de charge/performance du socle G2",
        "desc": "Le GIE Agora a lancé un projet visant à proposer une nouvelle version de socle technique transverse (Socle G2). Dans le cadre de cette refonte, j’ai été missionné pour la mise en place d'une campagne de test de performance / robustesse afin d'éprouver la nouvelle architecture sous une forte charge.",
        "team": "1 Consultant",
        "tasks": ["Mise en place des outils de mesure (JVisualVM + plugins + JStatd)", "Assistance à la préparation des différents tests", "Surveillance des informations lors des tests", "Mise en place et test de différents paramétrages", "Création d’un rapport avec les préconisations pour une utilisation optimale."]
    },
    {
        "company": "Red Hat (via SQLI)",
        "logo": "maif",
        "customer": "MAIF (for Red Hat)",
        "cat": "Conseil & Expertise",
        "dtstart": "2010-04-19",
        "dtend": "2010-09-13",
        "tags": ["AIX", "Linux", "Red Hat", "RHEL", "RPM", "JBoss EAP", "JBoss Operation Network (JON)", "Ant", "Shell", "Apache", "JMX", "Java", "JEE"],
        "role": "Consultant Senior Red Hat",
        "title": "Création d'une plateforme mutualisée et automatisée de clusters JBoss",
        "desc": "Dans le cadre de la migration de certains services vers une architecture Linux/JBoss, les services techniques de la MAIF voulaient être en mesure de mettre en place très rapidement des plateformes JBoss supervisées par JON afin de les proposer aux équipes projets. La mise en place de cette industrialisation des serveurs JBoss a été confiée au Red Hat Professional Services qui me l’a sous-traité.",
        "team": "1 Consultant",
        "tasks": ["Préparation et configuration du serveur", "Mise en place des scripts et adaptation au nouveau contexte (AIX -> Linux)", "Création de RPM permettant de déployer le produit et les nouveaux scripts", "Mise en place de JBoss Operation Network et configuration", "Industrialisation du déploiement de JBoss Operation Network."]
    },
    {
        "company": "SQLI",
        "logo": "jti",
        "customer": "Japan Tabacco International (JTI)",
        "cat": "Conseil & Expertise",
        "dtstart": "2010-07-05",
        "dtend": "2010-09-13",
        "tags": ["Windows 2003 Server", "MS SQL", "JMeter", "JSF", "JMS", "JBoss AS", "Java", "JVisualVM", "Jstatd"],
        "role": "Consultant Perf. IT",
        "title": "Audit de performance",
        "desc": "Suite à des problèmes de performance sur la future version de son outil de traçabilité, un audit de l’application et de son environnement m’a été demandé, en partenariat avec les équipes métier basées à Genève.",
        "team": "2 Consultants",
        "tasks": ["Préconisation d'installation", "de sécurisation et d’optimisation du serveur JBoss AS. ", "Analyse statique de l’application", "Analyse statique du serveur", "Analyse dynamique avec injection via JMeter", "Mise en place des outils de mesure (JVisualVM + plugins + JStatd)", "Surveillance des informations lors des tests", "Création d’un rapport avec les préconisations pour une utilisation optimale."]
    },
    {
        "company": "SQLI",
        "logo": "tigf",
        "customer": "TIGF",
        "cat": "Conseil & Expertise",
        "dtstart": "2010-12-06",
        "dtend": "2013-05-17",
        "tags": ["JBoss EAP", "Linux", "Red Hat Enterprise Linux", "Certificats SSL", "HTTPS", "XML", "SMS"],
        "role": "Architecte / Expert JEE",
        "title": "Expertise ponctuelle JEE",
        "desc": "Dans le cadre de son activité informatique générale et du projet Tetra, TIGF a fait appel à mes services sous forme d’assistance ponctuelle aux équipes lors de problèmes techniques autour de la sécurité et de JBoss ou de demande d’assistance sur des points d’architecture.",
        "team": "1 Consultant",
        "tasks": ["Assistance JBoss sur le projet TETRA", "Sécurisation des échanges entre les serveurs TETRA (authentification forte M2M)", "Mise à jour et assistance lors des changements de certificats", "Étude sur les stratégies et solutions d’authentification double facteurs."]
    },
    {
        "company": "SQLI",
        "logo": "toulouse-metropole",
        "customer": "Toulouse Metropole",
        "cat": "Conseil & Expertise",
        "dtstart": "2011-03-07",
        "dtend": "2011-06-03",
        "tags": ["Apache", "Linux", "Red Hat", "RHEL", "mod_proxy", "mod_rewrite", "ESB", "JMeter", "soap UI"],
        "role": "Architecte / Expert JEE",
        "title": "Prototypage d'une solution de routage WS",
        "desc": "La collectivité a émis le souhait de se doter d’une plateforme centralisée de routage des appels web services, sans pour autant mettre en œuvre un ESB (projet plus long terme en cours). Dans cette optique, elle m’a confié la définition et mise en place d'une solution de routage des appels de type web services, ainsi que la mise en œuvre de tests de performances afin de valider sa robustesse sous la charge.",
        "team": "1 Consultant",
        "tasks": ["Analyse du besoin", "Comparaison des solutions et des scénarios possible", "Mise en œuvre de la solution sélectionnée", "Analyse des performances", "-Définition des scénarios et des réponses attendues", "-Écriture des scénarios pour le métrokit (industrialisation Jmeter)", "-Exécution des tests", "collecte des informations et adaptation de l’environnement", "Assistance aux équipes pour la première utilisation."]
    },
    {
        "company": "SQLI",
        "logo": "akerys",
        "customer": "Akerys / Belvia",
        "cat": "Conseil & Expertise",
        "dtstart": "2011-05-16",
        "dtend": "2011-08-08",
        "tags": ["Java", "JEE", "Struts", "Apache", "Linux", "Debian", "MySQL", "Talend", "JMeter", "JVisualVM", "JStatD", "hibernate"],
        "role": "Consultant Perf. IT",
        "title": "Tests de charge/performance de l'extranet conseiller",
        "desc": "Pour son nouvel extranet conseiller, permettant la gestion des portefeuilles clients, Akerys m’a confié la réalisation d'une campagne de test de performance et de robustesse de l’application.",
        "team": "1 Consultant",
        "tasks": ["Définition des scénarios et des réponses attendues", "Écriture des scénarios pour le Métrokit (JMeter)", "Exécution des tests", "Préconisation de modifications hibernate. "]
    },
    {
        "company": "SQLI",
        "logo": "toulouse-metropole",
        "customer": "Toulouse Metropole",
        "cat": "Conseil & Expertise",
        "dtstart": "2011-02-21",
        "dtend": "2011-03-25",
        "tags": ["JMeter", "Apache", "JVisualVM", "Tomcat", "Linux", "Red Hat", "lutèce"],
        "role": "Consultant Perf. IT",
        "title": "Tests de charge/performance DUI",
        "desc": "Chaque année, la communauté urbaine Toulouse Métropole lance une grande campagne de mise à jour des informations de ses administrés (DUI – Dossier Unique d’Inscription). Cette campagne permet à l’ensemble des administrés de saisir leurs informations (adresse, téléphone, revenus, …) pour permettre un calcul des charges et l’utilisation des télé services (paiement des crèches, CLAE, …). Ce service un peu particulier reçoit une charge très importante sur une courte période et doit être en mesure de tenir cette charge afin de garantir le service aux administrés. La collectivité m’a confié la charge de réaliser l’ensemble des tests de performance et de robustesse, et de l’assister dans la sécurisation de ce service.",
        "team": "1 Consultant",
        "tasks": ["Définition des scénarios et des réponses attendues", "Écriture des scénarios pour le métrokit (JMeter)", "Amélioration des outils du metrokit", "Exécution des tests", "Préconisations auprès de l'éditeur pour la mise en place d'une structure adaptée et sécurisée."]
    },
    {
        "company": "SQLI",
        "logo": "sogelink",
        "customer": "Sogelink",
        "cat": "Conseil & Expertise",
        "dtstart": "2011-04-04",
        "dtend": "2011-12-16",
        "tags": ["Linux CentOS", "JBoss AS", "Java", "JEE", "Shell", "Jopr", "RHQ."],
        "role": "Architecte / Expert JEE",
        "title": "Audit applicatif & socle d'exploitation",
        "desc": "Suite à quelques problématiques de performances autour du logiciel qu’elle édite (mode SAAS), la société Sogelink m’a confié la réalisation d’un audit de l'existant de sa plateforme DICT afin d’identifier les points d’amélioration et de préconiser les chantiers à mettre en œuvre pour l'industrialisation de sa prochaine version de produit.",
        "team": "1 Consultant",
        "tasks": ["Audit de l'existant", "Définition des améliorations et des plannings associés", "Travail avec la DSI sur les différentes stratégies possibles."]
    },
    {
        "company": "SQLI",
        "logo": "msa",
        "customer": "GIE Agora (MSA)",
        "cat": "Conseil & Expertise",
        "dtstart": "2012-01-09",
        "dtend": "2012-03-23",
        "tags": ["Java", "JEE", "Tapestry", "JMeter", "Linux", "JBoss", "Dynatrace", "Autohotkey", "javascript"],
        "role": "Architecte / Expert JEE",
        "title": "Prototypage refonte des interfaces",
        "desc": "Le GIE Agora a mis en place un projet de remplacement des interfaces lourdes pour la saisie des actes de santé. La nouvelle solution à base de socle G2 et de formulaire web utilisant le framework Tapestry devait être testée dans le cadre de formulaires importants (nombreux champs). Le GIE Agora m’a confié la tâche de valider la faisabilité d’une saisie rapide et continue d’actes sans que la stabilité du serveur ou du navigateur ne soit mise en cause.",
        "team": "1 Consultant",
        "tasks": ["Définition des scénarios et des réponses attendues", "Écriture des scénarios pour le métrokit (JMeter)", "Mise en place du Metrokit en environnement de test", "Exécution des tests", "Adaptation de la configuration de la PFS pour tenir une charge soutenue", "Tests d'endurance au niveau du navigateur (javascript)."]
    },
    {
        "company": "SQLI",
        "logo": "sicap",
        "customer": "SICAP",
        "cat": "Conseil & Expertise",
        "dtstart": "2012-04-04",
        "dtend": "2012-04-08",
        "tags": ["JBoss AS", "Windows", "JVisualVM", "Jstatd"],
        "role": "Architecte / Expert JEE",
        "title": "Expertise incident de production JBoss",
        "desc": "La société SICAP propose des services aux opérateurs de téléphonie de plusieurs pays, et notamment la mise à jour des cartes SIM via les réseaux GSM. C’est dans la cadre de cette activité qu’un dysfonctionnement a été remarqué au niveau d’une plateforme d’un opérateur au Kazakhstan. Le problème se traduisait par une forte dégradation des performances lors de l’utilisation des fonctionnalités de clustering JBoss, aboutissant parfois à une interruption de service. Elle m’a missionné pour que je réalise un diagnostic rapide du problème de lenteur et la préconisation d’une solution. Le problème n’affectant que les plateformes de production, toutes les manipulations devaient être réalisées lors de plages d’interventions nocturnes.",
        "team": "1 Consultant",
        "tasks": ["Découverte du contexte et de la problématique", "Analyse à froid sur les plateformes d'intégration", "Analyse à chaud sur plateforme de correction (intervention de nuit)", "Identification d'un problème réseau", "Proposition d'une solution de contournement", "Supervision de la correction en production (intervention de nuit)", "Rédaction d'un rapport d'intervention (tests", "solutions et axes d'amélioration)."]
    },
    {
        "company": "SQLI",
        "logo": "toulouse-metropole",
        "customer": "Toulouse Metropole",
        "cat": "Conseil & Expertise",
        "dtstart": "2012-03-26",
        "dtend": "2012-04-27",
        "tags": ["Apache", "Linux", "Red Hat", "RHEL", "Alfresco", "Liferay", "MySQL", "Jasig CAS", "JMeter", "Metrokit", "Kerberos."],
        "role": "Consultant Perf. IT",
        "title": "Audit applicatif & socle d'exploitation",
        "desc": "Dans le cadre de l'intranet des agents (Sésame) basé sur Liferay Community et Alfresco EE, la collectivité m’a demandé une analyse de divers points de blocages dans la chaîne de liaison, ainsi que les causes d'un ralentissement important sous une charge moyenne.",
        "team": "2 Consultants, 1 Dev, 1 Architecte",
        "tasks": ["Diagnostic et correction de lenteurs liées à mod_auth_cas (Jasig CAS). ", "Correction de problèmes d'authentification Kerberos", "Dimensionnement et amélioration de la configuration Apache", "Tests de performance et de robustesse via Metrokit (JMeter)."]
    },
    {
        "company": "SQLI",
        "logo": "akerys",
        "customer": "Akerys / Belvia",
        "cat": "Conseil & Expertise",
        "dtstart": "2012-05-07",
        "dtend": "2012-06-08",
        "tags": ["Java", "JEE", "Tomcat", "Apache", "Linux", "Debian", "Talend", "MySQL", "Shell"],
        "role": "Consultant Perf. IT",
        "title": "Tests de charge/performance de l'interanet investisseur",
        "desc": "La société Akerys m’a missionné pour réaliser les tests de performance et de robustesse de son extranet investisseur, nouvellement redéveloppé pour l’entité Belvia.",
        "team": "1 Consultant",
        "tasks": ["Mise à jour des scénarios Metrokit", "Mise à jour des scénarios Talend", "Réalisation des tests de performance. "]
    },
    {
        "company": "SQLI",
        "logo": "msa",
        "customer": "GIE Agora (MSA)",
        "cat": "Conseil & Expertise",
        "dtstart": "2012-06-18",
        "dtend": "2013-01-18",
        "tags": ["Linux", "Red Hat", "JBoss EAP", "Apache", "Liferay EE", "JVisual VM", "PostgreSQL", "VMWare", "JMeter", "Metrokit."],
        "role": "Consultant Perf. IT",
        "title": "Audit applicatif & socle d'exploitation",
        "desc": "Suite à la mise en œuvre de son portail Internet basé sur Liferay EE, des problèmes de performance ont conduit à une panne des serveurs de production. L'objectif de la prestation pour laquelle le GIE Agora m’a missionné, était d'identifier les faiblesses de la chaîne de liaison et de proposer des améliorations.",
        "team": "1 Consultant",
        "tasks": ["Mise en place d'une plateforme de test de performance (Metrokit)", "Optimisation des serveurs JBoss", "Optimisation de la chaîne de liaison (RP Apache", "LB Apache", "JBoss", "PostgreSQL)", "Assistance audit applicatif Liferay EE 6", "Diagnostic et analyse des métriques collectées et des logs", "Définition des mesures de contournement et des procédures de reprise d'activité", "Assistance aux équipes métiers sur les évolutions à mettre en oeuvre", "Assistance aux équipes d'architecture et aux équipes de support"]
    },
    {
        "company": "SQLI",
        "logo": "clinique-pasteur",
        "customer": "Clinique Pasteur",
        "cat": "Conseil & Expertise",
        "dtstart": "2013-01-14",
        "dtend": "2013-04-19",
        "tags": ["Debian", "Linux", "Alfresco labs", "Lucene", "Java", "javascript", "css", "FreeMarker", "Html", "JQuery", "Webscript."],
        "role": "Expert Alfresco",
        "title": "Assistance développement base documentaire",
        "desc": "La clinique pasteur dispose d’une base documentaire, accessible a l’ensemble du personnel via son l’intranet. Cette base documentaire est importante car elle contient l’ensemble des procédures et protocoles de soins pour toutes les professions médicales. Les documents sont triés, validés, régulièrement mis à jour pour garantir les meilleurs soins aux patients. Cette base documentaire utilise une GED Alfresco Labs comme back-end. Les documents et la recherche sont gérés via des webscripts spécifiques afin de masquer la complexité de la GED aux utilisateurs. La clinique Pasteur a fait appel à mes services pour l’adaptation, l’évolution et la maintenance de sa GED Alfresco et des webscripts associés.",
        "team": "1 Consultant",
        "tasks": ["Assistance sur des problématiques Alfresco labs :", "-Création de batchs spécifiques pour les équipes qualité", "-Correction de bugs et petits défauts d'installation", "-Mise en place de webscripts et de requêtes lucenes adaptés aux besoins de la clinique", "-Mise en place d'un webscript de gestion de workflow (parapheur électronique)."]
    },
    {
        "company": "SQLI",
        "logo": "msa",
        "customer": "GIE Agora (MSA)",
        "cat": "Conseil & Expertise",
        "dtstart": "2013-05-06",
        "dtend": "2013-07-26",
        "tags": ["Java", "JEE", "RHEL", "Linux", "JBoss", "JEAP 6", "JMX", "mod_cluster", "cluster HA", "Apache", "JBoss CLI", "JBoss API", "Shell"],
        "role": "Expert JBoss",
        "title": "Prototypage migration JBoss EAP 6",
        "desc": "Pour son projet de migration Socle G1 vers Socle G2, le GIE Agora a souhaité étudier l’opportunité de modifier sa couche applicative JBoss d’une version EAP 4.x / 5.x vers une solution à base de JBoss EAP 6. Le GIE m’a demandé de les assister sur le prototypage et la définition de l’architecture à base de JBoss EAP 6 (Utilisation des modules, clusters par groupe, organisation des nœuds, …)",
        "team": "1 Consultant",
        "tasks": ["Assistance migration JBoss EAP 5 vers JBoss EAP 6 pour le socle technique G1 :", "-Définition de la stratégie de gestion des modules et des silos applicatifs", "-Mise en place des bonnes pratiques de développement avec JBoss EAP 6", "-Préconisation d'une architecture HA sous forme de groupes de clusters ?", "Réalisation d'un POC cluster Haute Disponibilité 3 hôtes / 4 instances en mode domaine", "Définition de la procédure de mise à jour applicative sans interruption de service."]
    },
    {
        "company": "SQLI",
        "logo": "cg31",
        "customer": "Conseil Général 31",
        "cat": "Conseil & Expertise",
        "dtstart": "2013-09-02",
        "dtend": "2013-10-25",
        "tags": ["Linux", "Centos", "Tomcat", "java", "jasig CAS", "SSO", "apache", "httpd", "kerberos", "Windows 2008 R2", "Active directory", "Spnego."],
        "role": "Expert IAM/SSO",
        "title": "Audit applicatif & socle d'exploitation SSO",
        "desc": "Le Conseil Général de la Haute Garonne a expérimenté des problèmes lors de la mise en place de sa solution SSO à base de Jasig CAS, plus spécialement sur la prise en charge des jetons Kerberos. J’ai été missionné pour analyser les problématiques liées à Jasig CAS et pour les corriger afin de rendre le SSO pleinement opérationnel.",
        "team": "1 Consultant",
        "tasks": ["Assistance à la mise en place d'une solution de SSO Jasig CAS avec authentification invisible (kerberos) pour les utilisateurs du domaine", "Mise en place / configuration d'une VM autonome (Linux + Tomcat + Cas + Apache Httpd)", "Mise en place de la configuration Kerberos pour un domaine avec AD 2008 R2", "Sécurisation / Nettoyage de l'installation pour la mise en production", "Livraison de la procédure d'installation."]
    },
    {
        "company": "SQLI",
        "logo": "ldcom",
        "customer": "Louis Dreyfus Commodities (LDCom)",
        "cat": "Conseil & Expertise",
        "dtstart": "2013-11-04",
        "dtend": "2013-11-22",
        "tags": ["Windows 2008 R2", "JBoss AS", "SAS", "VMWare", "Clustering", "Apache", "AJP", "Broadcast", "Jgroups"],
        "role": "Expert JBoss",
        "title": "Expertise incident de production JBoss",
        "desc": "Suite au déplacement de son infrastructure d’une salle machine vers une autre, la société LDCOM a commencé à remarquer un comportement anormal de son progiciel d’analyse SAS. Après élimination de toute cause matérielle, elle m’a missionné pour analyser le comportement du progiciel hébergé sur un serveur JBoss/Windows et proposer une solution pour rétablir son fonctionnement nominal.",
        "team": "NULL",
        "tasks": ["Audit de l'existant", "Analyse de l'architecture et des interactions Réseau/OS/SAS/JBoss", "Mise en évidence d'une solution de correction rapide (Quickfix)", "Préconisation d'une refonte d'architecture afin", "-d'améliorer la stabilité et la disponibilité de l'application", "-d'améliorer la gestion et l'administration de l'application et de son environnement", "-de simplifier les évolutions et les mises à jour."]
    },
    {
        "company": "SQLI",
        "logo": "meteo-france",
        "customer": "Météo France",
        "cat": "Conseil & Expertise",
        "dtstart": "2011-05-16",
        "dtend": "2014-07-18",
        "tags": ["Audit Applicatif", "Java", "JEE", "Red Hat Linux", "Swing", "JBoss EAP", "JMS", "Cluster", "Apache", "prosgreSQL", "EJB", "Eclipse", "Maven."],
        "role": "Expert JBoss",
        "title": "Accompagnement régulier en expertise JBoss",
        "desc": "Dans le cadre de la maintenance et de l’évolution de son application Vigilance, Météo France m’a confié plusieurs missions d’audit, de formation et d’expertise technique. ",
        "team": "1 Consultant",
        "tasks": ["Audit de l’application et de son éco système (2011)", "-Interview de l’équipe des développeurs, de la DSI et des exploitatants. ", "-Analyse des logs applicatifs", "-Réalisation et présentation d’un rapport d’audit", "Formation JBoss spécifique aux besoins MétéoFrance", "-Préparation des supports", "-Animation avec double public (Développeurs / Administrateurs)", "Identification des chantiers d’amélioration (2011)", "-Liste avec estimation des charges, des risques et des gains de chaque chantier", "-Conseil sur les évolutions de l’outil à moyen terme", "+ Version de JBoss", "+Mode de communication de l’application (EJB, Messaging MQ…", "+Clustering et haute disponibilité", "Assistance à la réalisation de chantiers (2014)", "-Assistance Migration JBoss EAP 6", "+Plateforme de développement (PIC)", "+Migration des EJB", "+Migration du messaging"]
    },
    {
        "company": "SQLI",
        "logo": "msa",
        "customer": "GIE Agora (MSA)",
        "cat": "Conseil & Expertise",
        "dtstart": "2014-01-13",
        "dtend": "2014-02-14",
        "tags": ["Liferay EE", "JBoss", "Red Hat Enterprise Linux", "Java", "JEE", "Apache", "PostgreSQL"],
        "role": "Expert Liferay",
        "title": "Préparation à la migration Liferay",
        "desc": "Suite à un précédent audit de performance, la MSA souhaitait faire évoluer son outil de portail (Liferay - www.msa.fr) vers une version plus récente, afin de pouvoir bénéficier, entre autres, de la réplication de base de données. Elle m’a confié la réalisation de la pré-étude de cadrage.",
        "team": "1 Consultant",
        "tasks": ["Réalisation d’une pré-étude avec pour objectifs:", "-D'identifier les versions cibles des composants (en fct. des règles entreprises et Liferay)", "-D'identifier la meilleure stratégie de migration possible et de proposer un scénario", "-D'identifier les impacts sur les développements et de donner une estimation de charge", "-De préconiser un plan de migration sur 6 mois / 1 an."]
    },
    {
        "company": "SQLI",
        "logo": "astia",
        "customer": "Astia",
        "cat": "Conseil & Expertise",
        "dtstart": "2014-02-10",
        "dtend": "2014-04-25",
        "tags": ["Citrix", "VMWare", "Microsoft IIS", ".Net", "MS SQL."],
        "role": "Consultant Perf. IT",
        "title": "Audit applicatif & socle d'exploitation",
        "desc": "A la demande du responsable du SI d’Astia, un audit m’a été confié afin de permettre la mise à jour de leur logiciel métier (progiciel Préventiel v6 vers v7) dans de bonnes conditions. Cette mission avait pour but d'assister le client dans la mise en œuvre de la nouvelle version de Préventiel, en anticipant les éventuels problèmes de performance côté SI (réseau, Citrix, VM, ...) mais aussi côté éditeur (Requêtes SQL non optimisées, ...). L'audit a également permis de mesurer l'alignement du SI client face à ses missions et de le comparer à l'état de l'art de SI de même taille.",
        "team": "2 Consultants",
        "tasks": ["Audit général du SI (réseau, infrastructure, applicatifs, ...)", "Audit spécifique au progiciel métier Préventiel", "Audit d'alignement du SI."]
    },
    {
        "company": "SQLI",
        "logo": "lpr",
        "customer": "LPR",
        "cat": "Conseil & Expertise",
        "dtstart": "2014-05-05",
        "dtend": "2015-02-06",
        "tags": ["RHEL", "JBoss EAP 6.2", "Java 7", "JEE 6", "EJB 3.1", "Messaging", "JMS", "SAP", "SAP JCO", "SAP JCA", "Apache", "Gitlab", "Jenkins."],
        "role": "Architecte / Expert JEE",
        "title": "Refonte plateforme cœur de métier",
        "desc": "Dans le cadre de son évolution, LPR a dû anticiper l'augmentation des volumes de données à traiter et faire évoluer son logiciel Eurospider en conséquence, ce qui a entraîné une contrainte de migration de l’environnement technique, entraînant à son tour une réécriture imposée des connecteurs SAP. LPR m’a confié le prototypage puis la réalisation de cette migration, ainsi que la réécriture d’une partie de l’application afin d’en améliorer les performances (Batch notamment). Migration : AIX 32b/Java 1.4 32b/Websphere ND 6.0/DB2 => RHEL 6.4 64b/Java 7 64b/JBoss EAP 6.2/DB2",
        "team": "NULL",
        "tasks": ["Réalisation d’un prototype pour validation de l’architecture:", "-Définition et validation de la plateforme cible", "-Analyse du code et identification des risques liés à la migration", "-Mise en œuvre d’un POC fonctionnel pour chacun des risques identifiés", "-Refonte complête du connecteur SAP en utilisant SAP JCO et les modules JBoss", "-Création d’un générateur automatique de code à partir des BAPI (basé sur JBoss Forge)", "-Proposition d’un planning de migration", "-Mise en place d’une plateforme d’intégration continue (Git, Gitlab, Jenckins, Nexus…)", "Migration iso-fonctionelle", "-Séparation des process de batch et utilisation des EJB TImer et EJB JMS", "-Sécurisation des parties de code présentant un risque (bug ou performance)", "-Sécurisation des plateformes Linux et des chaînes de liaison", "-Migration complête des plateformes d’exploitation", "Assistance technique ponctuelle", "-Assistance sécurisation Heartbleed", "-Assistance problématiques SSLv3"]
    },
    {
        "company": "SQLI",
        "logo": "clinique-pasteur",
        "customer": "Clinique Pasteur",
        "cat": "Conseil & Expertise",
        "dtstart": "2015-01-12",
        "dtend": "2015-06-19",
        "tags": ["Debian", "Linux", "Alfresco labs", "Lucene", "Java", "javascript", "css", "FreeMarker."],
        "role": "Expert Alfresco",
        "title": "Expertise pontcutelle Alfresco",
        "desc": "La clinique pasteur dispose d’une base documentaire, accessible à l’ensemble du personnel via son l’intranet. Cette base documentaire est importante car elle contient l’ensemble des procédures et protocoles de soins pour toutes les professions médicales. Les documents sont triés, validés, régulièrement mis à jour pour garantir les meilleurs soins aux patients. Cette base documentaire utilise une GED Alfresco Labs comme back-end. Les documents et la recherche sont gérés via des webscripts spécifiques afin de masquer la complexité de la GED aux utilisateurs. La clinique Pasteur a fait appel à mes services pour l’ajout de nouvelles fonctionnalités et l’amélioration de la recherche, en vue du passage de leur certification documentaire.",
        "team": "1 Consultant",
        "tasks": ["Adaptation du modèle de document Alfresco", "Création de webscripts afin d'adapter le comportement d'alfresco aux besoins du client", "Modification des critères de recherche et de pondération pour la partie portail de l'intranet", "Ajout de nouvelles fonctionnalités pour l'intranet documentaire"]
    },
    {
        "company": "SQLI",
        "logo": "toulouse-metropole",
        "customer": "Toulouse Metropole",
        "cat": "Conseil & Expertise",
        "dtstart": "2010-04-05",
        "dtend": "2015-08-27",
        "tags": ["Alfresco", "Linux", "RHEL", "JBoss", "JEAP", "CAS", "Share", "Cluster", "MySQL"],
        "role": "Expert Alfresco",
        "title": "Expertise pontcutelle Alfresco",
        "desc": "La collectivité a fait le choix de se doter d’une GED Alfresco EE afin de pouvoir gérer sa documentation projet ainsi que toute la conservation des documents de leur portail Liferay. C’est dans ce contexte qu’elle m’a confié l’accompagnement technique et métier ponctuel autour du produit Alfresco.",
        "team": "1 Consultant",
        "tasks": ["Gestion des commandes et tickets auprès de la société Alfresco", "Support Niveau 1", "Assistance lors des migrations (3.2 -> 3.4.2 -> 4.0.2)", "Audit de code des webscripts développer par des tiers", "Préconisation et mise en œuvre d'une architecture haute disponibilité et sécurisée", "Assistance autour des problématiques d'intégrité des données", "Création et réalisation de campagnes de tests de performance autour d'Alfresco et de Share."]
    },
    {
        "company": "SQLI",
        "logo": "lpr",
        "customer": "LPR",
        "cat": "Developpement",
        "dtstart": "2015-02-09",
        "dtend": "2015-08-27",
        "tags": ["Bootstrap", "AngularJS", "RestEasy", "Jax RS", "JBoss EAP", "Linux", "RHEL", "OAuth 2", "HMac", "SAP", "JCO", "Java", "JEE", "Javascript."],
        "role": "Architecte / Expert JEE",
        "title": "Conception et développement du portail web",
        "desc": "Suite à la réappropriation de son portail web, LPR souhaite le faire évoluer, via l'ajout de nouvelles fonctionnalités et une refonte complète des technologies employées. L’entreprise m’a confié la définition de l’architecture et la validation des décisions techniques liées au projet.",
        "team": "1 consultant + 2 devs Experimentés",
        "tasks": ["Définition et mise en œuvre d'une architecture AngularJS / API Restful:", "Nouvelle interface utilisateur responsive (Bootstrap + AngularJS)", "Exposition des BAPI SAP et du métier en mode Restful", "Gestion des échanges sécurisés (OAuth 2 / HMac)"]
    },
    {
        "company": "SQLI",
        "logo": "airfrance",
        "customer": "Air France",
        "cat": "Formation",
        "dtstart": "2008-05-05",
        "dtend": "2015-08-27",
        "tags": ["Power Point", "Java", "Jee", "Architectures Web", "Struts", "Angular JS"],
        "role": "Formateur Expert",
        "title": "Référents des formations JEE",
        "desc": "Création et animation du cursus de développement Java / JEE de AirFrance. En collaboration avec les équipes d’architectes Air France, j’ai pu concevoir le cursus complet de formation / reconversion des équipes au développement java. Le cursus de 13 jours permet à des personnes ne maitrisant pas le langage objet de connaître les bases du développement Java/JEE et la maitrise des outils et frameworks spécifiques à Air France.",
        "team": "1 Formateur",
        "tasks": ["Création / mise à jour du contenu pédagogique spécifique Air France", "Animation de formationsn (initiation objet, java, architectures web, JEE + frameworks)", "Gestion des cursus de formation"]
    },
    {
        "company": "SQLI",
        "logo": "sqli",
        "customer": "Alcyionx (SQLI)",
        "cat": "Conseil & Expertise",
        "dtstart": "2014-02-10",
        "dtend": "2015-08-27",
        "tags": ["Linux", "RHEL", "RHEV", "VMWare", "CloudForms", "Azure", "OpenShift", "JBoss ON", "DeployIt", "Docker", "Dynatrace."],
        "role": "Architecte Cloud",
        "title": "Création des offres Cloud",
        "desc": "Dans le cadre du renouvellement de ses activités, j’ai eu la charge, en tant que consultant senior Alcyonix, travailler à la mise en œuvre d’une nouvelle offre de service visant à accompagner les entreprises dans leur migration vers le Cloud. L’approche que j’ai retenue consistait en un accompagnement dans la sélection des outils, l’adaptation au changement, notamment ceux qui concernent la partie Delivery des produits dans le cadre de l’utilisation d’une solution PAAS.",
        "team": "1 Consultant Senior, 3 consultants",
        "tasks": ["Étude des solutions de cloud et de leurs impacts sur les entreprises", "Analyse des outillages pour la gestion du cloud", "des applicatifs et de leur monitoring", "Réalisation de prototypage afin de maitriser les différents outils", "Travail sur la définition des accompagnements possible et préparation d’un séminaire"]
    },
    {
        "company": "SQLI",
        "logo": "sqli",
        "customer": "Multiple",
        "cat": "Formation",
        "dtstart": "2008-05-05",
        "dtend": "2015-08-27",
        "tags": ["Power Point"],
        "role": "Formateur Expert",
        "title": "Formations pour SQLI Institut",
        "desc": "J’ai eu l’occasion d’animer plus de 120 formations intra et inter-entreprise. J’ai également occupé le rôle de référent technique de la formation, consistant à épauler l’équipe commerciale en qualifiant les demande, définissant les cursus et en pilotant la gestion des formateurs et des ressources.",
        "team": "1 Formateur, Commercial",
        "tasks": ["Création de contenu pédagogique générique et sur mesure", "Animation de formations", "Gestion de l’activité formation", "Formation et gestion du pool de formateurs"]
    },
    {
        "company": "onepoint",
        "logo": "spb",
        "customer": "SPB",
        "cat": "Expertise",
        "dtstart": "2015-09-14",
        "dtend": "2015-10-23",
        "tags": ["Java/JEE", "EJB Remote", "JBoss EAP", "Clustering", "JBoss CLI", "Linux", "RHEL"],
        "role": "Expert JBoss",
        "title": "Audit et amélioration du socle JEE",
        "desc": "La société a rencontré des problématiques de performance lors des appels d’EJB distants dans le contexte d’un cluster JEE. Elle m’a missionné dans le but d’identifier l’origine de ces problèmes et préconiser les solutions à mettre en œuvre à court et moyen terme pour obtenir une solution pérenne et scalable.",
        "team": "1 Consultant",
        "tasks": ["Identification de l’origine des ralentissements", "Travail avec les équipes locales pour le prototypage de solution de contournement", "Préconisation des chantiers à mener :", "-Cible : Architecture de microservices avec déploiement PAAS", "-Préconisation d’une évolution vers un fonctionnement DevOps", "Assistance à l’amélioration des outillages de déploiement sans rupture de service"]
    },
    {
        "company": "onepoint",
        "logo": "bdf",
        "customer": "Banque de France",
        "cat": "Expertise",
        "dtstart": "2015-10-05",
        "dtend": "2015-11-06",
        "tags": ["Java/JEE", "Websphere Application Server 7", "AIX", "Oracle"],
        "role": "Architecte / Expert JEE",
        "title": "Expertise incident de production",
        "desc": "Suite à l’apparition de problème de performances sur des web services en fin de chaîne SOA, la banque de France m’a missionné pour les aider à piloter les investigations des différentes équipes d’expert technique afin d’amener un regard neuf sur la problématique rencontrée.",
        "team": "1 Consultant",
        "tasks": ["Prise de contexte et étude des actions déjà menées", "Pilotage des équipes d’expertise et des actions à mener", "auprès du RMCO", "Réalisation d’un rapport d’audit."]
    },
    {
        "company": "onepoint",
        "logo": "min-justice",
        "customer": "Ministère de la justice",
        "cat": "Expertise",
        "dtstart": "2015-11-02",
        "dtend": "2016-08-16",
        "tags": ["Java/JEE", "JBoss EAP 5", "JBoss EAP 6", "Maven Oracle", "Ant", "EJB", "Web Services", "Eclipse"],
        "role": "Architecte / Expert JEE",
        "title": "Migration et optimisation JBoss",
        "desc": "Dans le cadre de la modernisation de l’outil de gestion de la chaîne pénale (Cassiopée), une migration de la suite applicative, de JBoss EAP 5 vers JBoss EAP 6 a été décidée. Ma mission consistait à identifier les différents impacts de la migration JBoss au niveau de l’application pour les corriger (intégration de Spring, nommage des EJB, externalisation de propriétés). J’ai aussi eu l’occasion de définir le mode de déploiement de l’application et son découpage application/module.",
        "team": "1 Consultant, Equipe CDS",
        "tasks": ["Prise de contexte et analyse du code et de la structure de build de l’application", "Préconisation des modifications nécessaires au projet", "-Génération des modules externes via Maven", "-Prise en compte des changements liés à l’utilisation de JBoss EAP 6.4", "-Modification du mode de packaging", "Travail en collaboration avec le Ministère et Red Hat autour du mode de livraison/déploiement."]
    },
    {
        "company": "onepoint",
        "logo": "trescal",
        "customer": "Trescal",
        "cat": "Conseil",
        "dtstart": "2016-02-01",
        "dtend": "2016-04-08",
        "tags": ["Java/JEE", "Tomcat", "Microsoft Windows Server", "MS SQL", "Apache"],
        "role": "Architecte / Expert JEE",
        "title": "Conception plateforme continentale HA JEE",
        "desc": "Dans le cadre de la mise en place de son ERP global multi-tenancy, Trescal a souhaité être accompagné afin de permettre la création d’une plateforme continentale haute disponibilité. Cette mission consistait à analyser l’ERP à déployer et de proposer une architecture HA compatible avec les ambitions de Trescal.",
        "team": "2 Consultants",
        "tasks": ["Prise de contexte et analyse des sources et de l’architecture de l’application", "Identification des modifications nécessaires au niveau applicatif", "Définition de l’architecture nécessaire au déploiement sur des plateformes continentales", "Déclinaison des actions sous forme de chantiers et plannification."]
    },
    {
        "company": "onepoint",
        "logo": "onepoint",
        "customer": "onepoint",
        "cat": "Prototypage",
        "dtstart": "2016-02-01",
        "dtend": "2016-03-18",
        "tags": ["Red Hat Enterprise Linux 7", "VMWare", "OpenStack 7", "CloudForms", "OpenShift Enterprise 3.2", "Docker", "Kubernetes"],
        "role": "Architecte Cloud",
        "title": "Création d'un cloud privé Red Hat",
        "desc": "En partenariat avec Red Hat, Groupe Onepoint a décidé de se doter d’une plateforme de type « cloud privé » à des fins de démonstration client et de prototypage. Dans le cadre de ce projet, un travail de mise en place d’une plateforme à base d’OpenStack, CloudForms et OpenShift a été réalisé conjointement avec Red Hat. Mon rôle consistait à piloter et participer pleinement à la conception et au déploiement de cet environnement.",
        "team": "2 Consultants",
        "tasks": ["Définition et préparation des pré-requis", "Installation de Red Hat OpenStack 7(plateforme IAAS)", "Installation de Cloudforms", "Installation de OpenShift Enterprise 3.2 (plateforme PaaS)", "-Basée sur Docker / Kubernetes / ETCD", "Démonstration et transfert de compétence aux équipes."]
    },
    {
        "company": "Red Hat (via onepoint)",
        "logo": "editis",
        "customer": "Editis Interforum",
        "cat": "ST Red Hat PS",
        "dtstart": "2016-02-01",
        "dtend": "2016-12-09",
        "tags": ["Java/JEE", "Weblogic Enterprise", "RHEL 6/7", "JBoss EAP 6.4", "F5 BigIP", "JDK Sun."],
        "role": "Expert JBoss",
        "title": "Etude migration Weblogic vers JBoss EAP",
        "desc": "Réalisation d’une étude d’opportunité sur la migration d’un groupe de 4 clusters Weblogic vers une solution à base de JBoss EAP 6.4. L’objectif de cette étude d’opportunité était de montrer la faisabilité de la migration, d’identifier d’éventuelles limites et les impacts applicatifs, et de proposer une estimation des charges le planning associé.",
        "team": "1 Consultant",
        "tasks": ["Analyse de l’existant et de son fonctionnement", "Programmation et réalisation d’ateliers de travail", "Analyse des applications déployées", "Travail autour des actions d’exploitation (déploiement en continuité de service", "monitoring …)."]
    },
    {
        "company": "onepoint",
        "logo": "icdc",
        "customer": "Caisse des Dépôts (ICDC)",
        "cat": "Prototypage",
        "dtstart": "2016-04-04",
        "dtend": "2016-11-04",
        "tags": ["Java/JEE", "Tomcat", "RHEL 6/7", "Alfresco 5", "API Rest", "Webscripts", "Apache", "Certificats Clients", "SolR"],
        "role": "Expert Alfresco",
        "title": "Prototypage d'une GED dénérique",
        "desc": "Réalisation d’un accompagnement au prototypage d’une solution de GED générique. Création et mise en place d’une API générique permettant d’inter-changer les solutions de stockage (File system, Alfresco via CMIS, Alfresco via son API propriétaire). Mise en évidence des points d’attention, de l’API, réalisation d’un POC et accrochage avec un front AngularJS. Définition de la cible HA/ haute volumétrie et des chantiers et phases de test nécessaires à la finalisation du projet.",
        "team": "1 Consultant",
        "tasks": ["Analyse des besoins et de l’existant", "Définition d’une cible temporaire et réalisation d’un prototype fonctionnel", "Assitance et expertise lors de l’accrochage", "Définition d’un API Rest", "Proposition d’une cible HA/HV et des chantiers nécessaires pour y arriver."]
    },
    {
        "company": "onepoint",
        "logo": "allianz",
        "customer": "allianz",
        "cat": "Conseil",
        "dtstart": "2016-06-06",
        "dtend": "2016-10-14",
        "tags": ["Java/JEE", "RHEL 6/7", "JBoss EAP 6.4", "SAVI", "JBoss CLI", "IPM", "QC", "ITSM", "Excel"],
        "role": "Consultant Senior",
        "title": "Audit organisationnel et technique",
        "desc": "Réalisation d’un audit organisationnel et technique comprenant l’analyse de l’organisation et du fonctionnement actuel du service et ses interactions avec le reste de l’entreprise, l’identification des chantiers d’amélioration et des évolutions possibles afin de préconiser une cible basée sur l’utilisation d’un centre de compétences. Réalisation d’une analyse documentaire, d’interviews, et d’ateliers participatifs afin de permettre une construction partagée des chantiers d’évolution. ",
        "team": "2 Consultants",
        "tasks": ["Recueil des enjeux de l’audit auprès de la Direction", "Réalisation d’interviews auprès des membres de l’équipe interne", "prestataire externe et services en relation (développement", "architecture)", "Ateliers de construction autour des scénarios managed et unmanaged avec les équipes ", "Formalisation d’un portefeuille de chantiers à mener sur la base d’une co-construction avec les équipes", "Présentation du plan d’actions"]
    },
    {
        "company": "Red Hat (via onepoint)",
        "logo": "poste",
        "customer": "La poste",
        "cat": "ST Red Hat PS",
        "dtstart": "2016-07-04",
        "dtend": "2016-07-29",
        "tags": ["RHEL", "JBoss Fuse", "OpenShift", "Camel", "Messaging (MQ)"],
        "role": "Expert JBoss",
        "title": "Accompagnement MOE Fuse ESB",
        "desc": "Accompagnement de la Poste Courrier dans la mise en œuvre de la plateforme Fuse et la migration d’une application à base de messaging. Coaching, transfert de compétence et support aux équipes.",
        "team": "1 Consultant",
        "tasks": ["Présentation de Fuse aux équipe et à la cellule architecture", "Installationde la plateforme et prototypage", "Définition de la stratégie de mise en œuvre et d’utilisation", "Conseil et accompagnement des équipes"]
    },
    {
        "company": "onepoint",
        "logo": "allianz",
        "customer": "Allianz",
        "cat": "Conseil",
        "dtstart": "2017-01-09",
        "dtend": "2017-05-12",
        "tags": ["Java", "JEE", "JBoss EAP", "Service Now", "Jira"],
        "role": "Consultant Senior",
        "title": "Amélioration MCO Cœur de métier",
        "desc": "Accompagnement des équipes (production/déploiement/développement) dans la mise en place des process visant à fluidifier le déploiement et la montée des versions logicielles.",
        "team": "2 Consultants",
        "tasks": ["Analyse des process existants", "Ateliers et échange avec les équipes", "Suivi de la mise en œuvre"]
    },
    {
        "company": "onepoint",
        "logo": "ferring",
        "customer": "Ferring International",
        "cat": "Expertise",
        "dtstart": "2017-03-06",
        "dtend": "2017-05-19",
        "tags": ["Windows Server", "Jboss EAP", "Java", "Jee", "MQ", "Pharma Suite"],
        "role": "Expert JBoss",
        "title": "MOE Plateforme JBoss HA",
        "desc": "Mise en place d’une plateforme JBoss Haute disponibilité (Clustering et MQ) en vue de l’installation de la solution Rockwell Automation Pharma Suite. Optimisation et industrialisation de la configuration JBoss.",
        "team": "1 Consultant",
        "tasks": ["Prise de connaissance du progiciel et des pré-requis", "Définition de l’architecture HA", "Mise en œuvre de la plateforme ", "Mise en place de la supervision", "Documentation (installation / Exploitation)"]
    },
    {
        "company": "onepoint",
        "logo": "lyreco",
        "customer": "Lyreco",
        "cat": "Expertise",
        "dtstart": "2017-03-27",
        "dtend": "2017-12-15",
        "tags": ["RHEV", "RHEL", "MQ", "Camel", "OpenShift", "CloudForms"],
        "role": "Expert OpenShift",
        "title": "MOE Plateforme PAAS privée",
        "desc": "Prototypage des solutions Red Hat dans le cadre du programme Extended Team de Red Hat. Accompagnement à la refonte du SI et à la mise en place d’une plateforme PaaS. Évaluation des solutions et définition des étapes de mise en œuvre. Expertise ponctuelle auprès de l’équipe en charge du déploiement.",
        "team": "Equipe Agile mixte",
        "tasks": ["Prototypage OpenShift", "Cadrage et préparation des étapes de mise en œuvre", "Expertise ponctuelle"]
    },
    {
        "company": "Red Hat (via onepoint)",
        "logo": "editis",
        "customer": "Editis Interforum (by Red Hat)",
        "cat": "ST Red Hat PS",
        "dtstart": "2017-05-08",
        "dtend": "2020-09-11",
        "tags": ["RHEL", "JBoss EAP", "Java", "Jee", "Weblogic", "F5 BigIP", "Shell", "Jasig CAS"],
        "role": "Expert JBoss",
        "title": "Migration Weblogic vers JBoss EAP",
        "desc": "Migration du cluster haute disponibilité Weblogique sur une plateforme à base de RHEL / JBoss EAP. Analyse des application et adaptation pour une prise en compte des nouvelles versions de Java et des fonctionnalités offertes par le serveur. Mise en place d’une communication entre la nouvelle plateforme et le router F5 BigIP pour la gestion automatique du routage et la continuité de service lors des mises à jours applicatives. ",
        "team": "1 Consultant",
        "tasks": ["Analyse des applications", "Prototypage de la plateforme et déploiement des applications migrées", "Adapatation des outils de déploiement", "Expertise Java / JBoss"]
    },
    {
        "company": "onepoint",
        "logo": "icdc",
        "customer": "Caisse des Dépôts (ICDC)",
        "cat": "Expertise",
        "dtstart": "2017-06-05",
        "dtend": "2017-10-27",
        "tags": ["RHEL", "Java", "Tomcat", "Alfresco one", "API Rest"],
        "role": "Expert Alfresco",
        "title": "MOE Alfresco HA",
        "desc": "Accompagnement à la définition de l’architecture et la mise en œuvre de la solution GED Alfresco one afin de gérer le stockage et l’archivage de la documentation vivante (hors archives).",
        "team": "1 Consultant",
        "tasks": ["Définition de l’architecture", "Prototypage de la solution", "Accompagnement des équipes lors de la mise en œuvre ", "Support aux équipes de production", "Expertise technique en environnement de production"]
    },
    {
        "company": "onepoint",
        "logo": "storengy",
        "customer": "Storengy",
        "cat": "Expertise",
        "dtstart": "2017-09-04",
        "dtend": "2017-12-16",
        "tags": ["RHEL", "OpenShift", "PaaS", "JEE"],
        "role": "Expert OpenShift",
        "title": "Expertise ponctuelle OpenShift",
        "desc": "Expertise ponctuelle auprès des équipes lors de la mise en place de la plateforme OpenShift et la migration de l’applicatif Java. Définition et validation de l’architecture applicative et de sa compatibilité avec la plateforme PaaS.",
        "team": "1 Consultant",
        "tasks": ["Recueil du besoin et de l’existant", "Définition de l’architecture de la plateforme PaaS", "Définition et validation de l’architecture applicative "]
    },
    {
        "company": "onepoint",
        "logo": "afd",
        "customer": "Agence France Developpement (AFD)",
        "cat": "Prototypage",
        "dtstart": "2017-10-09",
        "dtend": "2017-12-22",
        "tags": ["RHEL", "OpenShift", "Docker", "Ansible", "Gitlab", "Nexus"],
        "role": "Expert OpenShift",
        "title": "Prototypage plateforme support Devops",
        "desc": "Prototypage de la plateforme pilote de développement et de déploiement visant à supporter la méthodologie DevOps. Démonstration des capacités de la plateforme à gérer les développements et permettre la promotion des version du cloud vers le on promise.",
        "team": "1 consultant + 2 devs Experimentés",
        "tasks": ["Recueil des contraintes", "du contexte et de l’existant", "Définition de l’architecture", "Prototypage et mise en œuvre ", "Démonstration"]
    },
    {
        "company": "onepoint",
        "logo": "generali",
        "customer": "Generali",
        "cat": "Conseil",
        "dtstart": "2017-12-04",
        "dtend": "2018-03-02",
        "tags": ["RHEL", "OpenShift", "Ansible", "VMWare", "ZooKeeper", "Kafka", "Java", "JEE", "Docker", "Kubernetes"],
        "role": "Expert OpenShift",
        "title": "Cadrage MOE OpenShift",
        "desc": "Cadrage pour la mise en place d’une architecture haute disponibilité pour le déploiement de la nouvelle génération d’applications conteneurisées. ",
        "team": "1 Consultant",
        "tasks": ["Recueil des contraintes", "du contexte et de l’existant", "Animation d’ateliers techniques", "Définition des phases nécessaires à la mise en place", "Définition des accompagnements nécessaires"]
    },
    {
        "company": "onepoint",
        "logo": "agirc",
        "customer": "Agirc Arrco",
        "cat": "Conseil",
        "dtstart": "2017-12-04",
        "dtend": "2018-06-08",
        "tags": ["RHEL", "CMP", "PaaS", "Ansible", "Moteurs de workflow", "Composants middleware"],
        "role": "Architecte Cloud",
        "title": "Industrialisation plateforme PAAS",
        "desc": "Réalisation d’une étude comparative sur les différentes solutions d’industrialisation de la plateforme PaaS et l’opportunité de la mise en place d’un CMP. L’étude doit permettre de prendre en compte les travaux déjà réalisés et évaluer l’opportunité de les remplacer par des solutions standard du marché.",
        "team": "1 Consultant",
        "tasks": ["Recueil des contraintes", "du contexte et de l’existant", "Définition des critères d’évaluation et des solutions potentielles", "Evaluation des solutions ", "Préconisation de la solution la plus adaptée et de l’architecture recommandée", "Estimation des charges et coûts de mise en œuvre"]
    },
    {
        "company": "onepoint",
        "logo": "toulouse-metropole",
        "customer": "Toulouse Metropole",
        "cat": "Prototypage",
        "dtstart": "2017-12-11",
        "dtend": "2018-02-23",
        "tags": ["RHEL 7", "Satellite", "HAProxy", "Keepalived", "Syslog", "Shell", "Jasig Cas", "Java"],
        "role": "Architecte Cloud",
        "title": "Etude & prototypage Routage HA",
        "desc": "Réalisation d’une étude sur la mise en place d’un système de routage haute disponibilité à base de HAProxy / Keepalived. L’étude devait prendre en compte les spécifités des services à protéger (SSO, Messagerie …) et les règles imposées par le PRA de la collectivité. Un accompagnement à la mise en œuvre, via le prototypage, la documentation et le support aux équipes a également pu être réalisé. ",
        "team": "1 Consultant",
        "tasks": ["Recueil des contraintes et du PRA", "Réalisation d’une étude de cadrage et présentation des architectures possibles", "Prototypage de la solution pour le service de SSO multi sites. ", "Réalisation des documentation (DAT, manuel d’installation, manuel d’exploitation)", "Tests de charge et de disponibilité", "Accompagnement des équipes à l’installation dans les environnements"]
    },
    {
        "company": "onepoint",
        "logo": "onepoint",
        "customer": "onepoint",
        "cat": "Prototypage",
        "dtstart": "2017-06-05",
        "dtend": "2018-12-07",
        "tags": ["OpenShift", "GitHub", "Java", "Angular JS", "keycloak", "Jenkins", "docker"],
        "role": "Architecte Cloud",
        "title": "Création du produit MultiPaaS",
        "desc": "Développement d’un démonstrateur sur la capacité à créer facilement des chaînes CICD en cloud Hybride (Datacenter VMWare + AWS) et présentation au RH Forum. Passage du mode démonstrateur au mode projet et industrialisation du logiciel afin de proposer une version facilement déployable et utilisable en entreprise. ",
        "team": "1 consultant + 2 devs Experimentés",
        "tasks": ["Réalisation et présentation d’un démonstrateur", "Spécification de l’application", "Développement de l’application. ", "Suivi de l’avancement", "Présentation de l’application & communication"]
    },
    {
        "company": "onepoint",
        "logo": "socgen",
        "customer": "Société Générale",
        "cat": "ST Docker PS",
        "dtstart": "2018-10-05",
        "dtend": "2019-04-05",
        "tags": ["Docker EE", "VMWare", "Docker"],
        "role": "Consultant Senior",
        "title": "Audit organisationnel et technique",
        "desc": "Docker nous a missionné pour aider la société générale dans une démarche de sécurisation et d’accompagnement à la croissance de la plateforme Docker EE. Cette mission vise à garantir la capacité à exploiter la plateforme pour une charge potentiellement 10x supérieure à celle actuelle, dans le respect des SLA attendus. ",
        "team": "2 Consultants",
        "tasks": ["Kickoff et interview des équipes", "Ateliers de travail", "Identification des point d’attention ", "Définition d’un plan d’action", "Présentation et accompagnement."]
    },
    {
        "company": "onepoint",
        "logo": "franprix",
        "customer": "Franprix",
        "cat": "Expertise",
        "dtstart": "2018-06-18",
        "dtend": "2018-11-23",
        "tags": ["OpenShift", "BPMS", "3Scale", "Azure", "ARM", "Traefic", "Java", "docker", "Ansible"],
        "role": "Expert OpenShift",
        "title": "MOE Plateforme OpenShift sur Azure",
        "desc": "Pour un client retail de la grande distribution, accompagnement à la mise en place d’une plateforme OpenShift HA en environnement cloud Azure. Mise en place des outils BPM et API management, gestion du trafic, du stockage et accompagnement des équipe de développement pour la prise en main des nouveaux outils.",
        "team": "1 consultant + 2 devs Experimentés",
        "tasks": ["Préparation et définition des pré requis", "Mise en place de l’architecture Azure / OpenShift", "Installation de la plateforme et configuration. ", "Mise en place de la brique middleware", "Support aux équipes"]
    },
    {
        "company": "onepoint",
        "logo": "onepoint",
        "customer": "onepoint",
        "cat": "Expertise",
        "dtstart": "2019-01-14",
        "dtend": "2019-08-09",
        "tags": ["OpenShift", "Kubernetes", "Docker", "Gitlab", "Jenkins", "GitHub", "Ansible Tower", "VMWare", "Quay", "GlusterFS", "VCenter/VMWare", "NSX"],
        "role": "Expert OpenShift",
        "title": "Création et MCO plateforme Pier39",
        "desc": "Mise en place et mco de plateformes OpenShift 3.11 & 4.3 pour les projets d’incubation de onepoint et de ses partenaires. La plateforme est déployée sur une offre de cloud privé OVH et offre des prestations d’aide au développement et au déploiement (Jenkins + pipelines, registry privée, GitHub, …). ",
        "team": "1 consultant + 2 devs Experimentés",
        "tasks": ["Pilotage d’OVH pour le sous jacent cloud privé", "Déploiement d’OpenShift", "Ansible Tower", "GitHub et les outils CICD", "MCO", "monitoring et alerting de la plateforme", "Accompagnement des équipes de développement dans la transition vers la plateforme"]
    },
    {
        "company": "onepoint",
        "logo": "lilly",
        "customer": "Lilly",
        "cat": "Expertise",
        "dtstart": "2019-05-06",
        "dtend": "2019-11-08",
        "tags": ["OpenShift", "Kubernetes", "Docker", "Gitlab", "Jenkins", "JBoss EAP", "JBoss PAM (BPM)", "Java + Angular"],
        "role": "Expert OpenShift",
        "title": "Conception plateforme PaaS",
        "desc": "Mise en place d’une plateforme permettant d’accueillir un outil en mode SAAS visant à générer et exploiter des applications métier. ",
        "team": "3 architectes, 8 développeurs",
        "tasks": ["Préparation de la plateforme et des prérequis", "Expertises Red Hat ", "Développement de l’outil de génération en mode MVP"]
    },
    {
        "company": "onepoint",
        "logo": "bnppre",
        "customer": "BNP Paribas Real Estate",
        "cat": "Expertise",
        "dtstart": "2019-11-04",
        "dtend": "2020-10-02",
        "tags": ["OpenShift", "Kubernetes", "Docker", "Gitlab", "Jenkins", "Prometheus", "Elastic Search", "Fluentd", "Kibana", "PHP", "Drupal"],
        "role": "Expert OpenShift",
        "title": "Expertise plateforme OpenShift",
        "desc": "BNPP RE dispose d’une ancienne plateforme OpenShift 3.5 qui présente des problèmes de stabilité suite à une mise à jour abandonnée en milieu de process. onepoint a été missionné pour stabiliser la plateforme et proposer une solution de migration vers une solution pérenne (plateforme OpenShift 4).",
        "team": "1 Consultant",
        "tasks": ["Audit et identification des problèmes de stabilité", "Mise en place d’un workaround pour stabiliser la production", "Coaching des équipes ops", "Proposition d’un plan d’action visant à proposer une plateforme 4.3 production ready", "Accompagnement à la mise en place de la nouvelle plateforme"]
    },
    {
        "company": "onepoint",
        "logo": "bdf",
        "customer": "Banque de France",
        "cat": "Expertise",
        "dtstart": "2019-05-06",
        "dtend": "2019-11-15",
        "tags": ["OpenShift", "Kubernetes", "Docker", "Gitlab", "Jenkins", "Prometheus", "Elastic Search", "Fluentd", "Kibana"],
        "role": "Expert OpenShift",
        "title": "Expertise plateforme OpenShift",
        "desc": "La banque de France a missioné onepoint pour proposer la mise en place d’un cluster OpenShift afin de permettre la migration de leurs applications depuis l’ancienne plateforme Kubernetes. Le dispositif mis en place repose sur les expertises techniques onepoint et Red Hat, ainsi que sur nos capacités d’accompagnement. Le cluster doit prendre en compte des contraintes légales et sécuritaires très fortes, notamment sur les aspects réseau et stockage.",
        "team": "1 Consultant",
        "tasks": ["Préparation et définition des pré requis", "Mise en place du cluster OpenShift et configuration", "Ateliers spécifiques autour de la sécurité et du stockage", "Accompagnement autour des processus CICD", "Support aux équipes socle (Ops) et métiers (Dev)"]
    },
    {
        "company": "onepoint",
        "logo": "onepoint",
        "customer": "onepoint",
        "cat": "Prototypage",
        "dtstart": "2019-09-30",
        "dtend": "2020-03-13",
        "tags": ["AWS", "VMWare", "OpenShift 4", "Træfik EE", "Camel", "Java", "Ansible"],
        "role": "Architecte Cloud",
        "title": "Démonstrateur plateforme MultiCloud",
        "desc": "Dans la lignée du travail fait avec multipaas, nous avons décidé (onepoint, Red Hat et Containous/Træfik EE) de créer un démonstrateur permettant de déployer une application (avec données et composants stateful) sur plusieurs cloud/datacenter et de supporter la panne d’un fournisseur sans impact sur la disponibilité.",
        "team": "3 architectes",
        "tasks": ["Identification et reccueil du besoin", "Préparation des plateformes Openshift 4 (AWS & VMWare)", "Définition de l’architecture globale et applicative", "Coordination des équipes et accrochage des travaux de chacun", "Communication et démonstration"]
    },
    {
        "company": "onepoint",
        "logo": "dnsce",
        "customer": "Douanes (DNSCE)",
        "cat": "Conseil",
        "dtstart": "2019-09-09",
        "dtend": "2020-12-18",
        "tags": ["RHEL", "Ansible", "Kafka", "MQ", "ESB", "Tomcat", "JBoss", "Træfik EE", "Kong EE", "Safe"],
        "role": "Architecte / Expert JEE",
        "title": "Renfort équipe architecture transverse",
        "desc": "Dans le cadre de la refonte de son SI de lutte contre la fraude, la DNSCE nous a missionné pour fournir un architecte expérimenté pour accompagner ses effectifs. L’objectif de la mission est de lancer le projet de refonte et d’aider l’équipe en place à s’approprier le projet, dans un contexte de projet global SAFe.",
        "team": "1 Architecte",
        "tasks": ["Dossier d’étude de refonte complète du SI", "Spécification des composants", "Définition et réalisation de POCs", "Évaluation des solutions et aide à la décision", "Partage des connaissances et des pratiques"]
    },
    {
        "company": "onepoint",
        "logo": "lbp",
        "customer": "La Banque Postale (LBP)",
        "cat": "Conseil",
        "dtstart": "2020-10-05",
        "dtend": "2021-04-02",
        "tags": ["OpenShift", "Java", "SSL", "SSO", "Java", "API REST"],
        "role": "Consultant Senior",
        "title": "Audit solution Certicode+",
        "desc": "Réalisation d’un audit autour de la chaine de liaison Certicode + visant à gérer les authentifications 2 facteurs (dans le cadre de DSP2). Interview des équipes et architectes, analyse des documentations, du code et des infrastructures (réseau, sécurité, machines et OpenShift). ",
        "team": "2 Consultants",
        "tasks": ["Recueil des inforamtions via des interviews/ateliers", "Analyse des documentations et productions existantes", "Recherches d’informations sur les insfrastructures (traces", "incidents …)", "Réalisation d’une restitutions avec QuickWins et chantiers de fonds"]
    },
    {
        "company": "onepoint",
        "logo": "arkea",
        "customer": "Arkea",
        "cat": "Conseil",
        "dtstart": "2020-09-07",
        "dtend": "2021-06-11",
        "tags": ["K8S", "OpenShift", "Anthos", "Tanzu", "Rancher", "Docker"],
        "role": "Consultant Senior",
        "title": "Définition stratégie Move 2 Cloud",
        "desc": "Dans le cadre de la stratégie move to cloud, accompagnement des équipes à la définition de la stratégie de migration des applications vers le cloud, aide à la définition de l’architecture Cloud Hybride / Multi Cloud. Animation des ateliers et aide à la sélection de la solution de containerisation.",
        "team": "2 Consultants",
        "tasks": ["Définition de l’architecture cloud hybride / Multi Cloud", "Définition et présentation de la stratégie de migration applicative", "Ateliers de définition des besoins autour de la containerisation", "Evaluation et des solutions de contenerisation"]
    },
    {
        "company": "onepoint",
        "logo": "stationord",
        "customer": "StatioNord",
        "cat": "Conseil",
        "dtstart": "2020-11-30",
        "dtend": "2021-08-23",
        "tags": ["Azure Cloud", "Terraform", "Ansible", "Confluence", "Jira", "K8S", "Keycloak"],
        "role": "Architecte Cloud",
        "title": "MOE plateforme  de services StatioNord",
        "desc": "Dans le cadre de la refonte de la gare du nord définition des services qui seront proposés dans la gare pour les employés, les partenaires et les usagers. Définition est mise en œuvre de la plateforme de service et de l’infrastructure cloud Azure sous-jacente.",
        "team": "Equipe Agile mixte",
        "tasks": ["Définition de l’architecture de la plateforme de service", "Participation aux ateliers de design", "Réalisation des DAT", "Définition de l’infra Cloud et de la landing Zone", "Mise en œuvre de l’infra cloud et de la landing Zone", "Prototypage de la plateforme de service et du SSO en haute disponibilité"]
    },
    {
        "company": "onepoint",
        "logo": "socgen",
        "customer": "Société Générale",
        "cat": "Conseil",
        "dtstart": "2021-10-11",
        "dtend": "2021-12-17",
        "tags": ["Azure Cloud", "AWS", "Kafka", "MQ", "Tomcat", "JBoss", "Terraform", "Safe", "Docker EE", "OpenShift", "Windows", "RHEL", "SQL Server", "PostgreSQL"],
        "role": "Architecte Cloud",
        "title": "Définition stratégie Move 2 Cloud",
        "desc": "Dans le cadre du programme Move2Cloud global de la société générale, la division des services transverses DDS nous a demandé de revoir la stratégie pour qu’elle soit adaptée aux spécificités de leur parc d’environ 200 applications (IAM, GED…). ",
        "team": "2 Consultants",
        "tasks": ["Interview des équipes", "Inventaires des applications et spécificités", "Identifiant des discriminants de cible cloud", "Définition d’une roadmap", "Adaptation de la roadmap aux contraintes"]
    },
    {
        "company": "onepoint",
        "logo": "arkea",
        "customer": "Arkea",
        "cat": "Conseil",
        "dtstart": "2022-01-04",
        "dtend": "2022-08-06",
        "tags": ["Docker", "OpenShift", "RHEL", "Ansible", "Terraform"],
        "role": "Expert OpenShift",
        "title": "Acculturation OpenShift",
        "desc": "Accompagnement des équipes dans la découverte d’Openshift et le cadrage d’une plateforme K8S de production afin de leur permettre d’appréhender les enjeux et les risques de la mise en œuvre de tels outils.",
        "team": "1 Consultant",
        "tasks": ["Présentation d’OpenShift", "Ateliers de cadrage", "Installation de la plateforme", "Démonstration de la plateforme", "Identification des integration avec le SI"]
    },
    {
        "company": "onepoint",
        "logo": "arkea",
        "customer": "Arkea",
        "cat": "Expertise",
        "dtstart": "2022-09-05",
        "dtend": "2022-11-11",
        "tags": ["RHEL", "JBoss", "Red Hat Decision Manager (BRMS)", "Ansible", "Terraform"],
        "role": "Expert JBoss",
        "title": "MOE Plateforme décisionnelle",
        "desc": "Dans le cadre de la refonte de la plateforme décisionnelle, Arkea nous a missionné pour les aider à déployer l’outil Red Hat Decision Manager (ex BRMS) dans les environnements de recette et de production et réaliser à leur côté un premier cas de règles autour de la validation de crédit.",
        "team": "2 Consultants",
        "tasks": ["Préparation des environnements", "Définition de l’architecture", "Installation et rédaction des kits de déploiement", "Accompagnement à l’écriture de règles", "Aide au déploiement et à l’intégration CI/CD"]
    },
    {
        "company": "onepoint",
        "logo": "socgen",
        "customer": "Société Générale",
        "cat": "Conseil",
        "dtstart": "2022-01-06",
        "dtend": "2023-05-24",
        "tags": ["Azure Cloud", "AWS", "Kafka", "MQ", "Tomcat", "JBoss", "Terraform", "Safe", "Docker EE", "OpenShift", "Windows", "RHEL", "SQL Server", "PostgreSQL"],
        "role": "Architecte Cloud",
        "title": "Renfort équipe architecture transverse",
        "desc": "Dans le cadre de sa compagne move2Cloud, l’entité transverse DDS m’a demandé de venir renforcer leur équipe d’architectes sur les aspects Multi Cloud. Intégré à l’équipe, j’ai eu en charge la préparation des déploiements, l’accompagnement des équipes métiers dans le processus de migration, ainsi que l’acculturation Cloud des autres architectes.",
        "team": "1 Architecte",
        "tasks": ["Accompagnement des équipes pour la migration", "Identification des enablers et correction des points bloquants", "Suivi et adaptation de la roadmap Cloud", "Accompagnement à la définition des LZ multi Cloud (Azure/AWS/Privées)", "Support aux équipes"]
    },
    {
        "company": "onepoint",
        "logo": "matmut",
        "customer": "Matmut",
        "cat": "Conseil",
        "dtstart": "2023-06-06",
        "dtend": "2023-12-16",
        "tags": ["Google Sens", "GKE", "K8S", "Terraform"],
        "role": "Architecte Cloud",
        "title": "Définition et création d'une LZ Goocle Sens",
        "desc": "La Matmut à fait le choix d’ouvrir une plateforme décisionnelle dans le Cloud de Google en s’appuyant sur l’offre Google Sens pour garantir la souveraineté des données et de l’exploitation. Onepoint a été missioné dans ce contexte pour accompagner la mise en œuvre de la landing zone Google Sens.",
        "team": "1 Architecte, 1 Développeur",
        "tasks": ["Acculturation des équipes à Google Sens", "Ateliers d’identification des besoins et contraintes", "Définition de la landing Zone", "Mise en œuvre de la landing zone"]
    },
    {
        "company": "onepoint",
        "logo": "alphacred",
        "customer": "Alpha Credit 360",
        "cat": "Conseil",
        "dtstart": "2023-05-02",
        "dtend": "2024-04-26",
        "tags": ["Tomcat", "RHEL", "Windows", "Docker", "AS400", "Drupal", "Java", "Springboot"],
        "role": "Architecte Cloud",
        "title": "Définition stratégie Move 2 Cloud",
        "desc": "La société Alpha Credit 360 (Cetelem Belgique, filiale de BNP Paribas) m’a missionné pour les accompagner dans la préparation de la migration de leurs assets on premise vers le cloud privé du groupe BNPP, avec pour objectif de limiter au minimum les applications restant on premise. ",
        "team": "1 CP, 1 Architecte",
        "tasks": ["Interview des équipes", "Identifiant des discriminants de migration", "Inventaire des applications", "Définition de la roadmap", "Adaptation aux contraintes planning & budget"]
    },
    {
        "company": "onepoint",
        "logo": "kaufman",
        "customer": "Kaufman & Broad",
        "cat": "Conseil",
        "dtstart": "2023-10-10",
        "dtend": "2024-03-18",
        "tags": ["IA Générative", "Chat GPT", "Azure openAI"],
        "role": "Consultant IA",
        "title": "Cadrage prototype IA Gen",
        "desc": "Kaufman & Braud a missionné onepoint pour les accompagner dans le cadrage d’un prototype autour de l’IA Gen. Cet accompagnement consiste en plusieurs ateliers avec les équipes métiers pour identifier les cas d’usages utiles au métier, puis au tri de ceux-ci jusqu’à ne retenir que les cas pertinents pour un prototypage. ",
        "team": "2 Consultants",
        "tasks": ["Interview des équipes métier", "Identification des uses cases", "Mesure de l’effort technique et du gain business des UC", "Priorisation et préconisation"]
    },
    {
        "company": "onepoint",
        "logo": "tmh",
        "customer": "Toulouse Metropole Habitat",
        "cat": "Conseil",
        "dtstart": "2024-01-15",
        "dtend": "2024-02-23",
        "tags": ["Azure Cloud", "Tomcat", "VMWare"],
        "role": "Architecte Cloud",
        "title": "Définition stratégie Move 2 Cloud",
        "desc": "Dans le cadre de sa migration Move2Cloud visant à supprimer les data center locaux au bénéfice du cloud Azure, Toulouse Métropole Habitat nous a demandé de les accompagner sur cette migration via la mise en œuvre d’une Landing Zone avec SLA et PRA de production, et la migration des applications existantes.",
        "team": "2 Architectes",
        "tasks": ["Présentation de la méthodologie Move2Cloud", "Acculturation sur les spécificités des containers", "Définition de la Landing Zone", "Migration de l’existant"]
    },
    {
        "company": "onepoint",
        "logo": "bnpp",
        "customer": "BNP Paribas",
        "cat": "Conseil",
        "dtstart": "2024-01-15",
        "dtend": "2024-02-09",
        "tags": ["IA Générative", "Chat GPT", "Azure openAI"],
        "role": "Consultant IA",
        "title": "Cadrage usages IA Gen",
        "desc": "Accompagnement des équipes métiers de BNP Paribas pour la définition des uses cases pertinent et apporteurs de valeurs autour de l’IA génératives appliquée à leur métier.",
        "team": "2 Consultants",
        "tasks": ["Présentation d’exemples de use cases", "Interviews et séances d’idéations", "Estimation des efforts/gain des uses cases"]
    },
    {
        "company": "onepoint",
        "logo": "onepoint",
        "customer": "onepoint",
        "cat": "Expertise",
        "dtstart": "2020-04-30",
        "dtend": "2022-01-07",
        "tags": ["OVH Cloud", "VMWare", "Kuberneties", "Traefic", "Terraform", "Ansible", "Apache", "HA Proxy", "PostgreSQL", "Decision Manager (BRMS)"],
        "role": "Architecte Cloud",
        "title": "Création d'une plateforme PaaS HA HDS",
        "desc": "Pendant la période COVID, onepoint a créé un outil permettant, sur la base d’un questionnaire quotidien, de définir le retour ou non d’un salarié dans les locaux ou en zone à faible densité. Dans ce cadre, j’ai eu la charge de créer la plateforme PaaS de production en marque blanche, pour permettre les déploiements des clients, dans un environnement sécurisé et HDS (Habilitation Données de Santé).",
        "team": "Equipe Agile mixte",
        "tasks": ["Définition de la plateforme", "Création d’un prototype et validation", "Création des scripts Terraform/Ansible de déploiement", "Sécurisation et transfert aux équipes HDS de l’hébergeur"]
    },
    {
        "company": "onepoint",
        "logo": "onepoint",
        "customer": "onepoint",
        "cat": "Prototypage",
        "dtstart": "2024-01-08",
        "dtend": "2024-04-26",
        "tags": ["Azure Cloud", "Azure Open AI", "Terraform"],
        "role": "Architecte Cloud",
        "title": "Industrialisation d'un Chatbot IA Gen",
        "desc": "Réalisation de travaux en vue de l’automatisation des déploiements du chatbot neo de onepoint sur l’environnement Azure Cloud.",
        "team": "1 Consultant",
        "tasks": ["Identifications des composants utilisés par le prototype", "Définition d’une architecture", "Développement de scripts Terraform"]
    }
]